OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
/*
 * This declarations of the PIC16LF18875 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:25 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16LF18875_H__
#define __PIC16LF18875_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTB_ADDR              0x000D
#define PORTC_ADDR              0x000E
#define PORTD_ADDR              0x000F
#define PORTE_ADDR              0x0010
#define TRISA_ADDR              0x0011
#define TRISB_ADDR              0x0012
#define TRISC_ADDR              0x0013
#define TRISD_ADDR              0x0014
#define TRISE_ADDR              0x0015
#define LATA_ADDR               0x0016
#define LATB_ADDR               0x0017
#define LATC_ADDR               0x0018
#define LATD_ADDR               0x0019
#define LATE_ADDR               0x001A
#define TMR0_ADDR               0x001C
#define TMR0L_ADDR              0x001C
#define PR0_ADDR                0x001D
#define TMR0H_ADDR              0x001D
#define T0CON0_ADDR             0x001E
#define T0CON1_ADDR             0x001F
#define ADRES_ADDR              0x008C
#define ADRESL_ADDR             0x008C
#define ADRESH_ADDR             0x008D
#define ADPREV_ADDR             0x008E
#define ADPREVL_ADDR            0x008E
#define ADPREVH_ADDR            0x008F
#define ADACC_ADDR              0x0090
#define ADACCL_ADDR             0x0090
#define ADACCH_ADDR             0x0091
#define ADCON0_ADDR             0x0093
#define ADCON1_ADDR             0x0094
#define ADCON2_ADDR             0x0095
#define ADCON3_ADDR             0x0096
#define ADSTAT_ADDR             0x0097
#define ADCLK_ADDR              0x0098
#define ADACT_ADDR              0x0099
#define ADREF_ADDR              0x009A
#define ADCAP_ADDR              0x009B
#define ADPRE_ADDR              0x009C
#define ADACQ_ADDR              0x009D
#define ADPCH_ADDR              0x009E
#define ADCNT_ADDR              0x010C
#define ADRPT_ADDR              0x010D
#define ADLTH_ADDR              0x010E
#define ADLTHL_ADDR             0x010E
#define ADLTHH_ADDR             0x010F
#define ADUTH_ADDR              0x0110
#define ADUTHL_ADDR             0x0110
#define ADUTHH_ADDR             0x0111
#define ADSTPT_ADDR             0x0112
#define ADSTPTL_ADDR            0x0112
#define ADSTPTH_ADDR            0x0113
#define ADFLTR_ADDR             0x0114
#define ADFLTRL_ADDR            0x0114
#define ADFLTRH_ADDR            0x0115
#define ADERR_ADDR              0x0116
#define ADERRL_ADDR             0x0116
#define ADERRH_ADDR             0x0117
#define RC1REG_ADDR             0x0119
#define RCREG_ADDR              0x0119
#define RCREG1_ADDR             0x0119
#define TX1REG_ADDR             0x011A
#define TXREG_ADDR              0x011A
#define TXREG1_ADDR             0x011A
#define SP1BRG_ADDR             0x011B
#define SP1BRGL_ADDR            0x011B
#define SPBRG_ADDR              0x011B
#define SPBRG1_ADDR             0x011B
#define SPBRGL_ADDR             0x011B
#define SP1BRGH_ADDR            0x011C
#define SPBRGH_ADDR             0x011C
#define SPBRGH1_ADDR            0x011C
#define RC1STA_ADDR             0x011D
#define RCSTA_ADDR              0x011D
#define RCSTA1_ADDR             0x011D
#define TX1STA_ADDR             0x011E
#define TXSTA_ADDR              0x011E
#define TXSTA1_ADDR             0x011E
#define BAUD1CON_ADDR           0x011F
#define BAUDCON_ADDR            0x011F
#define BAUDCON1_ADDR           0x011F
#define BAUDCTL_ADDR            0x011F
#define BAUDCTL1_ADDR           0x011F
#define SSP1BUF_ADDR            0x018C
#define SSP1ADD_ADDR            0x018D
#define SSP1MSK_ADDR            0x018E
#define SSP1STAT_ADDR           0x018F
#define SSP1CON1_ADDR           0x0190
#define SSP1CON2_ADDR           0x0191
#define SSP1CON3_ADDR           0x0192
#define SSP2BUF_ADDR            0x0196
#define SSP2ADD_ADDR            0x0197
#define SSP2MSK_ADDR            0x0198
#define SSP2STAT_ADDR           0x0199
#define SSP2CON1_ADDR           0x019A
#define SSP2CON2_ADDR           0x019B
#define SSP2CON3_ADDR           0x019C
#define TMR1L_ADDR              0x020C
#define TMR1H_ADDR              0x020D
#define T1CON_ADDR              0x020E
#define PR1_ADDR                0x020F
#define T1GCON_ADDR             0x020F
#define T1GATE_ADDR             0x0210
#define TMR1GATE_ADDR           0x0210
#define T1CLK_ADDR              0x0211
#define TMR1CLK_ADDR            0x0211
#define TMR3L_ADDR              0x0212
#define TMR3H_ADDR              0x0213
#define T3CON_ADDR              0x0214
#define PR3_ADDR                0x0215
#define T3GCON_ADDR             0x0215
#define T3GATE_ADDR             0x0216
#define TMR3GATE_ADDR           0x0216
#define T3CLK_ADDR              0x0217
#define TMR3CLK_ADDR            0x0217
#define TMR5L_ADDR              0x0218
#define TMR5H_ADDR              0x0219
#define T5CON_ADDR              0x021A
#define PR5_ADDR                0x021B
#define T5GCON_ADDR             0x021B
#define T5GATE_ADDR             0x021C
#define TMR5GATE_ADDR           0x021C
#define T5CLK_ADDR              0x021D
#define TMR5CLK_ADDR            0x021D
#define CCPTMRS0_ADDR           0x021E
#define CCPTMRS1_ADDR           0x021F
#define T2TMR_ADDR              0x028C
#define TMR2_ADDR               0x028C
#define PR2_ADDR                0x028D
#define T2PR_ADDR               0x028D
#define T2CON_ADDR              0x028E
#define T2HLT_ADDR              0x028F
#define T2CLKCON_ADDR           0x0290
#define T2RST_ADDR              0x0291
#define T4TMR_ADDR              0x0292
#define TMR4_ADDR               0x0292
#define PR4_ADDR                0x0293
#define T4PR_ADDR               0x0293
#define T4CON_ADDR              0x0294
#define T4HLT_ADDR              0x0295
#define T4CLKCON_ADDR           0x0296
#define T4RST_ADDR              0x0297
#define T6TMR_ADDR              0x0298
#define TMR6_ADDR               0x0298
#define PR6_ADDR                0x0299
#define T6PR_ADDR               0x0299
#define T6CON_ADDR              0x029A
#define T6HLT_ADDR              0x029B
#define T6CLKCON_ADDR           0x029C
#define T6RST_ADDR              0x029D
#define CCPR1_ADDR              0x030C
#define CCPR1L_ADDR             0x030C
#define CCPR1H_ADDR             0x030D
#define CCP1CON_ADDR            0x030E
#define CCP1CAP_ADDR            0x030F
#define CCPR2_ADDR              0x0310
#define CCPR2L_ADDR             0x0310
#define CCPR2H_ADDR             0x0311
#define CCP2CON_ADDR            0x0312
#define CCP2CAP_ADDR            0x0313
#define CCPR3_ADDR              0x0314
#define CCPR3L_ADDR             0x0314
#define CCPR3H_ADDR             0x0315
#define CCP3CON_ADDR            0x0316
#define CCP3CAP_ADDR            0x0317
#define CCPR4_ADDR              0x0318
#define CCPR4L_ADDR             0x0318
#define CCPR4H_ADDR             0x0319
#define CCP4CON_ADDR            0x031A
#define CCP4CAP_ADDR            0x031B
#define CCPR5_ADDR              0x031C
#define CCPR5L_ADDR             0x031C
#define CCPR5H_ADDR             0x031D
#define CCP5CON_ADDR            0x031E
#define CCP5CAP_ADDR            0x031F
#define PWM6DCL_ADDR            0x038C
#define PWM6DCH_ADDR            0x038D
#define PWM6CON_ADDR            0x038E
#define PWM7DCL_ADDR            0x0390
#define PWM7DCH_ADDR            0x0391
#define PWM7CON_ADDR            0x0392
#define SCANLADRL_ADDR          0x040C
#define SCANLADRH_ADDR          0x040D
#define SCANHADRL_ADDR          0x040E
#define SCANHADRH_ADDR          0x040F
#define SCANCON0_ADDR           0x0410
#define SCANTRIG_ADDR           0x0411
#define CRCDATA_ADDR            0x0416
#define CRCDATL_ADDR            0x0416
#define CRCDATH_ADDR            0x0417
#define CRCACC_ADDR             0x0418
#define CRCACCL_ADDR            0x0418
#define CRCACCH_ADDR            0x0419
#define CRCSHFT_ADDR            0x041A
#define CRCSHIFTL_ADDR          0x041A
#define CRCSHIFTH_ADDR          0x041B
#define CRCXOR_ADDR             0x041C
#define CRCXORL_ADDR            0x041C
#define CRCXORH_ADDR            0x041D
#define CRCCON0_ADDR            0x041E
#define CRCCON1_ADDR            0x041F
#define SMT1TMR_ADDR            0x048C
#define SMT1TMRL_ADDR           0x048C
#define SMT1TMRH_ADDR           0x048D
#define SMT1TMRU_ADDR           0x048E
#define SMT1CPR_ADDR            0x048F
#define SMT1CPRL_ADDR           0x048F
#define SMT1CPRH_ADDR           0x0490
#define SMT1CPRU_ADDR           0x0491
#define SMT1CPW_ADDR            0x0492
#define SMT1CPWL_ADDR           0x0492
#define SMT1CPWH_ADDR           0x0493
#define SMT1CPWU_ADDR           0x0494
#define SMT1PR_ADDR             0x0495
#define SMT1PRL_ADDR            0x0495
#define SMT1PRH_ADDR            0x0496
#define SMT1PRU_ADDR            0x0497
#define SMT1CON0_ADDR           0x0498
#define SMT1CON1_ADDR           0x0499
#define SMT1STAT_ADDR           0x049A
#define SMT1CLK_ADDR            0x049B
#define SMT1SIG_ADDR            0x049C
#define SMT1WIN_ADDR            0x049D
#define SMT2TMR_ADDR            0x050C
#define SMT2TMRL_ADDR           0x050C
#define SMT2TMRH_ADDR           0x050D
#define SMT2TMRU_ADDR           0x050E
#define SMT2CPR_ADDR            0x050F
#define SMT2CPRL_ADDR           0x050F
#define SMT2CPRH_ADDR           0x0510
#define SMT2CPRU_ADDR           0x0511
#define SMT2CPW_ADDR            0x0512
#define SMT2CPWL_ADDR           0x0512
#define SMT2CPWH_ADDR           0x0513
#define SMT2CPWU_ADDR           0x0514
#define SMT2PR_ADDR             0x0515
#define SMT2PRL_ADDR            0x0515
#define SMT2PRH_ADDR            0x0516
#define SMT2PRU_ADDR            0x0517
#define SMT2CON0_ADDR           0x0518
#define SMT2CON1_ADDR           0x0519
#define SMT2STAT_ADDR           0x051A
#define SMT2CLK_ADDR            0x051B
#define SMT2SIG_ADDR            0x051C
#define SMT2WIN_ADDR            0x051D
#define NCO1ACC_ADDR            0x058C
#define NCO1ACCL_ADDR           0x058C
#define NCO1ACCH_ADDR           0x058D
#define NCO1ACCU_ADDR           0x058E
#define NCO1INC_ADDR            0x058F
#define NCO1INCL_ADDR           0x058F
#define NCO1INCH_ADDR           0x0590
#define NCO1INCU_ADDR           0x0591
#define NCO1CON_ADDR            0x0592
#define NCO1CLK_ADDR            0x0593
#define CWG1CLKCON_ADDR         0x060C
#define CWG1ISM_ADDR            0x060D
#define CWG1DBR_ADDR            0x060E
#define CWG1DBF_ADDR            0x060F
#define CWG1CON0_ADDR           0x0610
#define CWG1CON1_ADDR           0x0611
#define CWG1AS0_ADDR            0x0612
#define CWG1AS1_ADDR            0x0613
#define CWG1STR_ADDR            0x0614
#define CWG2CLKCON_ADDR         0x0616
#define CWG2ISM_ADDR            0x0617
#define CWG2DBR_ADDR            0x0618
#define CWG2DBF_ADDR            0x0619
#define CWG2CON0_ADDR           0x061A
#define CWG2CON1_ADDR           0x061B
#define CWG2AS0_ADDR            0x061C
#define CWG2AS1_ADDR            0x061D
#define CWG2STR_ADDR            0x061E
#define CWG3CLKCON_ADDR         0x068C
#define CWG3ISM_ADDR            0x068D
#define CWG3DBR_ADDR            0x068E
#define CWG3DBF_ADDR            0x068F
#define CWG3CON0_ADDR           0x0690
#define CWG3CON1_ADDR           0x0691
#define CWG3AS0_ADDR            0x0692
#define CWG3AS1_ADDR            0x0693
#define CWG3STR_ADDR            0x0694
#define PIR0_ADDR               0x070C
#define PIR1_ADDR               0x070D
#define PIR2_ADDR               0x070E
#define PIR3_ADDR               0x070F
#define PIR4_ADDR               0x0710
#define PIR5_ADDR               0x0711
#define PIR6_ADDR               0x0712
#define PIR7_ADDR               0x0713
#define PIR8_ADDR               0x0714
#define PIE0_ADDR               0x0716
#define PIE1_ADDR               0x0717
#define PIE2_ADDR               0x0718
#define PIE3_ADDR               0x0719
#define PIE4_ADDR               0x071A
#define PIE5_ADDR               0x071B
#define PIE6_ADDR               0x071C
#define PIE7_ADDR               0x071D
#define PIE8_ADDR               0x071E
#define PMD0_ADDR               0x0796
#define PMD1_ADDR               0x0797
#define PMD2_ADDR               0x0798
#define PMD3_ADDR               0x0799
#define PMD4_ADDR               0x079A
#define PMD5_ADDR               0x079B
#define WDTCON0_ADDR            0x080C
#define WDTCON1_ADDR            0x080D
#define WDTPSL_ADDR             0x080E
#define WDTPSH_ADDR             0x080F
#define WDTTMR_ADDR             0x0810
#define BORCON_ADDR             0x0811
#define PCON0_ADDR              0x0813
#define CCDCON_ADDR             0x0814
#define NVMADRL_ADDR            0x081A
#define NVMADRH_ADDR            0x081B
#define NVMDATL_ADDR            0x081C
#define NVMDATH_ADDR            0x081D
#define NVMCON1_ADDR            0x081E
#define NVMCON2_ADDR            0x081F
#define CPUDOZE_ADDR            0x088C
#define OSCCON1_ADDR            0x088D
#define OSCCON2_ADDR            0x088E
#define OSCCON3_ADDR            0x088F
#define OSCSTAT_ADDR            0x0890
#define OSCEN_ADDR              0x0891
#define OSCTUNE_ADDR            0x0892
#define OSCFRQ_ADDR             0x0893
#define CLKRCON_ADDR            0x0895
#define CLKRCLK_ADDR            0x0896
#define MDCON0_ADDR             0x0897
#define MDCON1_ADDR             0x0898
#define MDSRC_ADDR              0x0899
#define MDCARL_ADDR             0x089A
#define MDCARH_ADDR             0x089B
#define FVRCON_ADDR             0x090C
#define DAC1CON0_ADDR           0x090E
#define DAC1CON1_ADDR           0x090F
#define ZCD1CON_ADDR            0x091F
#define ZCDCON_ADDR             0x091F
#define CMOUT_ADDR              0x098F
#define CMSTAT_ADDR             0x098F
#define CM1CON0_ADDR            0x0990
#define CM1CON1_ADDR            0x0991
#define CM1NSEL_ADDR            0x0992
#define CM1PSEL_ADDR            0x0993
#define CM2CON0_ADDR            0x0994
#define CM2CON1_ADDR            0x0995
#define CM2NSEL_ADDR            0x0996
#define CM2PSEL_ADDR            0x0997
#define CLCDATA_ADDR            0x0E0F
#define CLC1CON_ADDR            0x0E10
#define CLC1POL_ADDR            0x0E11
#define CLC1SEL0_ADDR           0x0E12
#define CLC1SEL1_ADDR           0x0E13
#define CLC1SEL2_ADDR           0x0E14
#define CLC1SEL3_ADDR           0x0E15
#define CLC1GLS0_ADDR           0x0E16
#define CLC1GLS1_ADDR           0x0E17
#define CLC1GLS2_ADDR           0x0E18
#define CLC1GLS3_ADDR           0x0E19
#define CLC2CON_ADDR            0x0E1A
#define CLC2POL_ADDR            0x0E1B
#define CLC2SEL0_ADDR           0x0E1C
#define CLC2SEL1_ADDR           0x0E1D
#define CLC2SEL2_ADDR           0x0E1E
#define CLC2SEL3_ADDR           0x0E1F
#define CLC2GLS0_ADDR           0x0E20
#define CLC2GLS1_ADDR           0x0E21
#define CLC2GLS2_ADDR           0x0E22
#define CLC2GLS3_ADDR           0x0E23
#define CLC3CON_ADDR            0x0E24
#define CLC3POL_ADDR            0x0E25
#define CLC3SEL0_ADDR           0x0E26
#define CLC3SEL1_ADDR           0x0E27
#define CLC3SEL2_ADDR           0x0E28
#define CLC3SEL3_ADDR           0x0E29
#define CLC3GLS0_ADDR           0x0E2A
#define CLC3GLS1_ADDR           0x0E2B
#define CLC3GLS2_ADDR           0x0E2C
#define CLC3GLS3_ADDR           0x0E2D
#define CLC4CON_ADDR            0x0E2E
#define CLC4POL_ADDR            0x0E2F
#define CLC4SEL0_ADDR           0x0E30
#define CLC4SEL1_ADDR           0x0E31
#define CLC4SEL2_ADDR           0x0E32
#define CLC4SEL3_ADDR           0x0E33
#define CLC4GLS0_ADDR           0x0E34
#define CLC4GLS1_ADDR           0x0E35
#define CLC4GLS2_ADDR           0x0E36
#define CLC4GLS3_ADDR           0x0E37
#define PPSLOCK_ADDR            0x0E8F
#define INTPPS_ADDR             0x0E90
#define T0CKIPPS_ADDR           0x0E91
#define T1CKIPPS_ADDR           0x0E92
#define T1GPPS_ADDR             0x0E93
#define T3CKIPPS_ADDR           0x0E94
#define T3GPPS_ADDR             0x0E95
#define T5CKIPPS_ADDR           0x0E96
#define T5GPPS_ADDR             0x0E97
#define T2AINPPS_ADDR           0x0E9C
#define T4AINPPS_ADDR           0x0E9D
#define T6AINPPS_ADDR           0x0E9E
#define CCP1PPS_ADDR            0x0EA1
#define CCP2PPS_ADDR            0x0EA2
#define CCP3PPS_ADDR            0x0EA3
#define CCP4PPS_ADDR            0x0EA4
#define CCP5PPS_ADDR            0x0EA5
#define SMT1WINPPS_ADDR         0x0EA9
#define SMT1SIGPPS_ADDR         0x0EAA
#define SMT2WINPPS_ADDR         0x0EAB
#define SMT2SIGPPS_ADDR         0x0EAC
#define CWG1PPS_ADDR            0x0EB1
#define CWG2PPS_ADDR            0x0EB2
#define CWG3PPS_ADDR            0x0EB3
#define MDCARLPPS_ADDR          0x0EB8
#define MDCARHPPS_ADDR          0x0EB9
#define MDSRCPPS_ADDR           0x0EBA
#define CLCIN0PPS_ADDR          0x0EBB
#define CLCIN1PPS_ADDR          0x0EBC
#define CLCIN2PPS_ADDR          0x0EBD
#define CLCIN3PPS_ADDR          0x0EBE
#define ADCACTPPS_ADDR          0x0EC3
#define SSP1CLKPPS_ADDR         0x0EC5
#define SSP1DATPPS_ADDR         0x0EC6
#define SSP1SSPPS_ADDR          0x0EC7
#define SSP2CLKPPS_ADDR         0x0EC8
#define SSP2DATPPS_ADDR         0x0EC9
#define SSP2SSPPS_ADDR          0x0ECA
#define RXPPS_ADDR              0x0ECB
#define TXPPS_ADDR              0x0ECC
#define RA0PPS_ADDR             0x0F10
#define RA1PPS_ADDR             0x0F11
#define RA2PPS_ADDR             0x0F12
#define RA3PPS_ADDR             0x0F13
#define RA4PPS_ADDR             0x0F14
#define RA5PPS_ADDR             0x0F15
#define RA6PPS_ADDR             0x0F16
#define RA7PPS_ADDR             0x0F17
#define RB0PPS_ADDR             0x0F18
#define RB1PPS_ADDR             0x0F19
#define RB2PPS_ADDR             0x0F1A
#define RB3PPS_ADDR             0x0F1B
#define RB4PPS_ADDR             0x0F1C
#define RB5PPS_ADDR             0x0F1D
#define RB6PPS_ADDR             0x0F1E
#define RB7PPS_ADDR             0x0F1F
#define RC0PPS_ADDR             0x0F20
#define RC1PPS_ADDR             0x0F21
#define RC2PPS_ADDR             0x0F22
#define RC3PPS_ADDR             0x0F23
#define RC4PPS_ADDR             0x0F24
#define RC5PPS_ADDR             0x0F25
#define RC6PPS_ADDR             0x0F26
#define RC7PPS_ADDR             0x0F27
#define RD0PPS_ADDR             0x0F28
#define RD1PPS_ADDR             0x0F29
#define RD2PPS_ADDR             0x0F2A
#define RD3PPS_ADDR             0x0F2B
#define RD4PPS_ADDR             0x0F2C
#define RD5PPS_ADDR             0x0F2D
#define RD6PPS_ADDR             0x0F2E
#define RD7PPS_ADDR             0x0F2F
#define RE0PPS_ADDR             0x0F30
#define RE1PPS_ADDR             0x0F31
#define RE2PPS_ADDR             0x0F32
#define ANSELA_ADDR             0x0F38
#define WPUA_ADDR               0x0F39
#define ODCONA_ADDR             0x0F3A
#define SLRCONA_ADDR            0x0F3B
#define INLVLA_ADDR             0x0F3C
#define IOCAP_ADDR              0x0F3D
#define IOCAN_ADDR              0x0F3E
#define IOCAF_ADDR              0x0F3F
#define CCDNA_ADDR              0x0F40
#define CCDPA_ADDR              0x0F41
#define ANSELB_ADDR             0x0F43
#define WPUB_ADDR               0x0F44
#define ODCONB_ADDR             0x0F45
#define SLRCONB_ADDR            0x0F46
#define INLVLB_ADDR             0x0F47
#define IOCBP_ADDR              0x0F48
#define IOCBN_ADDR              0x0F49
#define IOCBF_ADDR              0x0F4A
#define CCDNB_ADDR              0x0F4B
#define CCDPB_ADDR              0x0F4C
#define ANSELC_ADDR             0x0F4E
#define WPUC_ADDR               0x0F4F
#define ODCONC_ADDR             0x0F50
#define SLRCONC_ADDR            0x0F51
#define INLVLC_ADDR             0x0F52
#define IOCCP_ADDR              0x0F53
#define IOCCN_ADDR              0x0F54
#define IOCCF_ADDR              0x0F55
#define CCDNC_ADDR              0x0F56
#define CCDPC_ADDR              0x0F57
#define ANSELD_ADDR             0x0F59
#define WPUD_ADDR               0x0F5A
#define ODCOND_ADDR             0x0F5B
#define SLRCOND_ADDR            0x0F5C
#define INLVLD_ADDR             0x0F5D
#define CCDND_ADDR              0x0F61
#define CCDPD_ADDR              0x0F62
#define ANSELE_ADDR             0x0F64
#define WPUE_ADDR               0x0F65
#define ODCONE_ADDR             0x0F66
#define SLRCONE_ADDR            0x0F67
#define INLVLE_ADDR             0x0F68
#define IOCEP_ADDR              0x0F69
#define IOCEN_ADDR              0x0F6A
#define IOCEF_ADDR              0x0F6B
#define CCDNE_ADDR              0x0F6C
#define CCDPE_ADDR              0x0F6D
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

