OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0019) __sfr LATD;

typedef struct
  {
  unsigned LATD0                : 1;
  unsigned LATD1                : 1;
  unsigned LATD2                : 1;
  unsigned LATD3                : 1;
  unsigned LATD4                : 1;
  unsigned LATD5                : 1;
  unsigned LATD6                : 1;
  unsigned LATD7                : 1;
  } __LATDbits_t;

extern __at(0x0019) volatile __LATDbits_t LATDbits;

#define _LATD0                  0x01
#define _LATD1                  0x02
#define _LATD2                  0x04
#define _LATD3                  0x08
#define _LATD4                  0x10
#define _LATD5                  0x20
#define _LATD6                  0x40
#define _LATD7                  0x80

//==============================================================================


//==============================================================================
//        LATE Bits

extern __at(0x001A) __sfr LATE;

typedef union
  {
  struct
    {
    unsigned LATE0              : 1;
    unsigned LATE1              : 1;
    unsigned LATE2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned LATE               : 3;
    unsigned                    : 5;
    };
  } __LATEbits_t;

extern __at(0x001A) volatile __LATEbits_t LATEbits;

#define _LATE0                  0x01
#define _LATE1                  0x02
#define _LATE2                  0x04

//==============================================================================


//==============================================================================
//        TMR0 Bits

extern __at(0x001C) __sfr TMR0;

typedef struct
  {
  unsigned TMR0L0               : 1;
  unsigned TMR0L1               : 1;
  unsigned TMR0L2               : 1;
  unsigned TMR0L3               : 1;
  unsigned TMR0L4               : 1;
  unsigned TMR0L5               : 1;
  unsigned TMR0L6               : 1;
  unsigned TMR0L7               : 1;
  } __TMR0bits_t;

extern __at(0x001C) volatile __TMR0bits_t TMR0bits;

#define _TMR0L0                 0x01
#define _TMR0L1                 0x02
#define _TMR0L2                 0x04
#define _TMR0L3                 0x08
#define _TMR0L4                 0x10
#define _TMR0L5                 0x20
#define _TMR0L6                 0x40
#define _TMR0L7                 0x80

//==============================================================================


//==============================================================================
//        TMR0L Bits

extern __at(0x001C) __sfr TMR0L;

typedef struct
  {
  unsigned TMR0L0               : 1;
  unsigned TMR0L1               : 1;
  unsigned TMR0L2               : 1;
  unsigned TMR0L3               : 1;
  unsigned TMR0L4               : 1;
  unsigned TMR0L5               : 1;
  unsigned TMR0L6               : 1;
  unsigned TMR0L7               : 1;
  } __TMR0Lbits_t;

extern __at(0x001C) volatile __TMR0Lbits_t TMR0Lbits;

#define _TMR0L_TMR0L0           0x01
#define _TMR0L_TMR0L1           0x02
#define _TMR0L_TMR0L2           0x04
#define _TMR0L_TMR0L3           0x08
#define _TMR0L_TMR0L4           0x10
#define _TMR0L_TMR0L5           0x20
#define _TMR0L_TMR0L6           0x40
#define _TMR0L_TMR0L7           0x80

//==============================================================================


//==============================================================================
//        PR0 Bits

extern __at(0x001D) __sfr PR0;

typedef union
  {
  struct
    {
    unsigned TMR0H0             : 1;
    unsigned TMR0H1             : 1;
    unsigned TMR0H2             : 1;
    unsigned TMR0H3             : 1;
    unsigned TMR0H4             : 1;
    unsigned TMR0H5             : 1;
    unsigned TMR0H6             : 1;
    unsigned TMR0H7             : 1;
    };

  struct
    {
    unsigned T0PR0              : 1;
    unsigned T0PR1              : 1;
    unsigned T0PR2              : 1;
    unsigned T0PR3              : 1;
    unsigned T0PR4              : 1;
    unsigned T0PR5              : 1;
    unsigned T0PR6              : 1;
    unsigned T0PR7              : 1;
    };
  } __PR0bits_t;

extern __at(0x001D) volatile __PR0bits_t PR0bits;

#define _TMR0H0                 0x01
#define _T0PR0                  0x01
#define _TMR0H1                 0x02
#define _T0PR1                  0x02
#define _TMR0H2                 0x04
#define _T0PR2                  0x04
#define _TMR0H3                 0x08
#define _T0PR3                  0x08
#define _TMR0H4                 0x10
#define _T0PR4                  0x10
#define _TMR0H5                 0x20
#define _T0PR5                  0x20
#define _TMR0H6                 0x40
#define _T0PR6                  0x40
#define _TMR0H7                 0x80
#define _T0PR7                  0x80

//==============================================================================


//==============================================================================
//        TMR0H Bits

extern __at(0x001D) __sfr TMR0H;

typedef union
  {
  struct
    {
    unsigned TMR0H0             : 1;
    unsigned TMR0H1             : 1;
    unsigned TMR0H2             : 1;
    unsigned TMR0H3             : 1;
    unsigned TMR0H4             : 1;
    unsigned TMR0H5             : 1;
    unsigned TMR0H6             : 1;
    unsigned TMR0H7             : 1;
    };

  struct
    {
    unsigned T0PR0              : 1;
    unsigned T0PR1              : 1;
    unsigned T0PR2              : 1;
    unsigned T0PR3              : 1;
    unsigned T0PR4              : 1;
    unsigned T0PR5              : 1;
    unsigned T0PR6              : 1;
    unsigned T0PR7              : 1;
    };
  } __TMR0Hbits_t;

extern __at(0x001D) volatile __TMR0Hbits_t TMR0Hbits;

#define _TMR0H_TMR0H0           0x01
#define _TMR0H_T0PR0            0x01
#define _TMR0H_TMR0H1           0x02
#define _TMR0H_T0PR1            0x02
#define _TMR0H_TMR0H2           0x04
#define _TMR0H_T0PR2            0x04
#define _TMR0H_TMR0H3           0x08
#define _TMR0H_T0PR3            0x08
#define _TMR0H_TMR0H4           0x10
#define _TMR0H_T0PR4            0x10
#define _TMR0H_TMR0H5           0x20
#define _TMR0H_T0PR5            0x20
#define _TMR0H_TMR0H6           0x40
#define _TMR0H_T0PR6            0x40
#define _TMR0H_TMR0H7           0x80
#define _TMR0H_T0PR7            0x80

//==============================================================================


//==============================================================================
//        T0CON0 Bits

extern __at(0x001E) __sfr T0CON0;

typedef union
  {
  struct
    {
    unsigned T0OUTPS0           : 1;
    unsigned T0OUTPS1           : 1;
    unsigned T0OUTPS2           : 1;
    unsigned T0OUTPS3           : 1;
    unsigned T016BIT            : 1;
    unsigned T0OUT              : 1;
    unsigned                    : 1;
    unsigned T0EN               : 1;
    };

  struct
    {
    unsigned T0OUTPS            : 4;
    unsigned                    : 4;
    };
  } __T0CON0bits_t;

