OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define _ADPREF0                0x01
#define _ADPREF1                0x02
#define _ADNREF                 0x10

//==============================================================================


//==============================================================================
//        ADCAP Bits

extern __at(0x009B) __sfr ADCAP;

typedef union
  {
  struct
    {
    unsigned ADCAP0             : 1;
    unsigned ADCAP1             : 1;
    unsigned ADCAP2             : 1;
    unsigned ADCAP3             : 1;
    unsigned ADCAP4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADCAP              : 5;
    unsigned                    : 3;
    };
  } __ADCAPbits_t;

extern __at(0x009B) volatile __ADCAPbits_t ADCAPbits;

#define _ADCAP0                 0x01
#define _ADCAP1                 0x02
#define _ADCAP2                 0x04
#define _ADCAP3                 0x08
#define _ADCAP4                 0x10

//==============================================================================


//==============================================================================
//        ADPRE Bits

extern __at(0x009C) __sfr ADPRE;

typedef struct
  {
  unsigned ADPRE0               : 1;
  unsigned ADPRE1               : 1;
  unsigned ADPRE2               : 1;
  unsigned ADPRE3               : 1;
  unsigned ADPRE4               : 1;
  unsigned ADPRE5               : 1;
  unsigned ADPRE6               : 1;
  unsigned ADPRE7               : 1;
  } __ADPREbits_t;

extern __at(0x009C) volatile __ADPREbits_t ADPREbits;

#define _ADPRE0                 0x01
#define _ADPRE1                 0x02
#define _ADPRE2                 0x04
#define _ADPRE3                 0x08
#define _ADPRE4                 0x10
#define _ADPRE5                 0x20
#define _ADPRE6                 0x40
#define _ADPRE7                 0x80

//==============================================================================


//==============================================================================
//        ADACQ Bits

extern __at(0x009D) __sfr ADACQ;

typedef struct
  {
  unsigned ADACQ0               : 1;
  unsigned ADACQ1               : 1;
  unsigned ADACQ2               : 1;
  unsigned ADACQ3               : 1;
  unsigned ADACQ4               : 1;
  unsigned ADACQ5               : 1;
  unsigned ADACQ6               : 1;
  unsigned ADACQ7               : 1;
  } __ADACQbits_t;

extern __at(0x009D) volatile __ADACQbits_t ADACQbits;

#define _ADACQ0                 0x01
#define _ADACQ1                 0x02
#define _ADACQ2                 0x04
#define _ADACQ3                 0x08
#define _ADACQ4                 0x10
#define _ADACQ5                 0x20
#define _ADACQ6                 0x40
#define _ADACQ7                 0x80

//==============================================================================


//==============================================================================
//        ADPCH Bits

extern __at(0x009E) __sfr ADPCH;

typedef union
  {
  struct
    {
    unsigned ADPCH0             : 1;
    unsigned ADPCH1             : 1;
    unsigned ADPCH2             : 1;
    unsigned ADPCH3             : 1;
    unsigned ADPCH4             : 1;
    unsigned ADPCH5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPCH              : 6;
    unsigned                    : 2;
    };
  } __ADPCHbits_t;

extern __at(0x009E) volatile __ADPCHbits_t ADPCHbits;

#define _ADPCH0                 0x01
#define _ADPCH1                 0x02
#define _ADPCH2                 0x04
#define _ADPCH3                 0x08
#define _ADPCH4                 0x10
#define _ADPCH5                 0x20

//==============================================================================


//==============================================================================
//        ADCNT Bits

extern __at(0x010C) __sfr ADCNT;

typedef struct
  {
  unsigned ADCNT0               : 1;
  unsigned ADCNT1               : 1;
  unsigned ADCNT2               : 1;
  unsigned ADCNT3               : 1;
  unsigned ADCNT4               : 1;
  unsigned ADCNT5               : 1;
  unsigned ADCNT6               : 1;
  unsigned ADCNT7               : 1;
  } __ADCNTbits_t;

extern __at(0x010C) volatile __ADCNTbits_t ADCNTbits;

#define _ADCNT0                 0x01
#define _ADCNT1                 0x02
#define _ADCNT2                 0x04
#define _ADCNT3                 0x08
#define _ADCNT4                 0x10
#define _ADCNT5                 0x20
#define _ADCNT6                 0x40
#define _ADCNT7                 0x80

//==============================================================================


//==============================================================================
//        ADRPT Bits

extern __at(0x010D) __sfr ADRPT;

typedef struct
  {
  unsigned ADRPT0               : 1;
  unsigned ADRPT1               : 1;
  unsigned ADRPT2               : 1;
  unsigned ADRPT3               : 1;
  unsigned ADRPT4               : 1;
  unsigned ADRPT5               : 1;
  unsigned ADRPT6               : 1;
  unsigned ADRPT7               : 1;
  } __ADRPTbits_t;

extern __at(0x010D) volatile __ADRPTbits_t ADRPTbits;

#define _ADRPT0                 0x01
#define _ADRPT1                 0x02
#define _ADRPT2                 0x04
#define _ADRPT3                 0x08
#define _ADRPT4                 0x10
#define _ADRPT5                 0x20
#define _ADRPT6                 0x40
#define _ADRPT7                 0x80

//==============================================================================

extern __at(0x010E) __sfr ADLTH;

//==============================================================================
//        ADLTHL Bits

extern __at(0x010E) __sfr ADLTHL;

typedef struct
  {
  unsigned ADLTH0               : 1;
  unsigned ADLTH1               : 1;
  unsigned ADLTH2               : 1;
  unsigned ADLTH3               : 1;
  unsigned ADLTH4               : 1;
  unsigned ADLTH5               : 1;
  unsigned ADLTH6               : 1;
  unsigned ADLTH7               : 1;
  } __ADLTHLbits_t;

extern __at(0x010E) volatile __ADLTHLbits_t ADLTHLbits;

#define _ADLTH0                 0x01
#define _ADLTH1                 0x02
#define _ADLTH2                 0x04
#define _ADLTH3                 0x08
#define _ADLTH4                 0x10
#define _ADLTH5                 0x20
#define _ADLTH6                 0x40
#define _ADLTH7                 0x80

//==============================================================================


//==============================================================================
//        ADLTHH Bits

extern __at(0x010F) __sfr ADLTHH;

typedef struct
  {
  unsigned ADLTH8               : 1;
  unsigned ADLTH9               : 1;
  unsigned ADLTH10              : 1;
  unsigned ADLTH11              : 1;
  unsigned ADLTH12              : 1;
  unsigned ADLTH13              : 1;
  unsigned ADLTH14              : 1;
  unsigned ADLTH15              : 1;
  } __ADLTHHbits_t;

extern __at(0x010F) volatile __ADLTHHbits_t ADLTHHbits;

#define _ADLTH8                 0x01
#define _ADLTH9                 0x02
#define _ADLTH10                0x04
#define _ADLTH11                0x08
#define _ADLTH12                0x10
#define _ADLTH13                0x20
#define _ADLTH14                0x40
#define _ADLTH15                0x80

//==============================================================================

