OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0110) __sfr ADUTH;

//==============================================================================
//        ADUTHL Bits

extern __at(0x0110) __sfr ADUTHL;

typedef struct
  {
  unsigned ADUTH0               : 1;
  unsigned ADUTH1               : 1;
  unsigned ADUTH2               : 1;
  unsigned ADUTH3               : 1;
  unsigned ADUTH4               : 1;
  unsigned ADUTH5               : 1;
  unsigned ADUTH6               : 1;
  unsigned ADUTH7               : 1;
  } __ADUTHLbits_t;

extern __at(0x0110) volatile __ADUTHLbits_t ADUTHLbits;

#define _ADUTH0                 0x01
#define _ADUTH1                 0x02
#define _ADUTH2                 0x04
#define _ADUTH3                 0x08
#define _ADUTH4                 0x10
#define _ADUTH5                 0x20
#define _ADUTH6                 0x40
#define _ADUTH7                 0x80

//==============================================================================


//==============================================================================
//        ADUTHH Bits

extern __at(0x0111) __sfr ADUTHH;

typedef struct
  {
  unsigned ADUTH8               : 1;
  unsigned ADUTH9               : 1;
  unsigned ADUTH10              : 1;
  unsigned ADUTH11              : 1;
  unsigned ADUTH12              : 1;
  unsigned ADUTH13              : 1;
  unsigned ADUTH14              : 1;
  unsigned ADUTH15              : 1;
  } __ADUTHHbits_t;

extern __at(0x0111) volatile __ADUTHHbits_t ADUTHHbits;

#define _ADUTH8                 0x01
#define _ADUTH9                 0x02
#define _ADUTH10                0x04
#define _ADUTH11                0x08
#define _ADUTH12                0x10
#define _ADUTH13                0x20
#define _ADUTH14                0x40
#define _ADUTH15                0x80

//==============================================================================

extern __at(0x0112) __sfr ADSTPT;

//==============================================================================
//        ADSTPTL Bits

extern __at(0x0112) __sfr ADSTPTL;

typedef struct
  {
  unsigned ADSTPT0              : 1;
  unsigned ADSTPT1              : 1;
  unsigned ADSTPT2              : 1;
  unsigned ADSTPT3              : 1;
  unsigned ADSTPT4              : 1;
  unsigned ADSTPT5              : 1;
  unsigned ADSTPT6              : 1;
  unsigned ADSTPT7              : 1;
  } __ADSTPTLbits_t;

extern __at(0x0112) volatile __ADSTPTLbits_t ADSTPTLbits;

#define _ADSTPT0                0x01
#define _ADSTPT1                0x02
#define _ADSTPT2                0x04
#define _ADSTPT3                0x08
#define _ADSTPT4                0x10
#define _ADSTPT5                0x20
#define _ADSTPT6                0x40
#define _ADSTPT7                0x80

//==============================================================================


//==============================================================================
//        ADSTPTH Bits

extern __at(0x0113) __sfr ADSTPTH;

typedef struct
  {
  unsigned ADSTPT8              : 1;
  unsigned ADSTPT9              : 1;
  unsigned ADSTPT10             : 1;
  unsigned ADSTPT11             : 1;
  unsigned ADSTPT12             : 1;
  unsigned ADSTPT13             : 1;
  unsigned ADSTPT14             : 1;
  unsigned ADSTPT15             : 1;
  } __ADSTPTHbits_t;

extern __at(0x0113) volatile __ADSTPTHbits_t ADSTPTHbits;

#define _ADSTPT8                0x01
#define _ADSTPT9                0x02
#define _ADSTPT10               0x04
#define _ADSTPT11               0x08
#define _ADSTPT12               0x10
#define _ADSTPT13               0x20
#define _ADSTPT14               0x40
#define _ADSTPT15               0x80

//==============================================================================

extern __at(0x0114) __sfr ADFLTR;

//==============================================================================
//        ADFLTRL Bits

extern __at(0x0114) __sfr ADFLTRL;

typedef struct
  {
  unsigned ADFLTR0              : 1;
  unsigned ADFLTR1              : 1;
  unsigned ADFLTR2              : 1;
  unsigned ADFLTR3              : 1;
  unsigned ADFLTR4              : 1;
  unsigned ADFLTR5              : 1;
  unsigned ADFLTR6              : 1;
  unsigned ADFLTR7              : 1;
  } __ADFLTRLbits_t;

extern __at(0x0114) volatile __ADFLTRLbits_t ADFLTRLbits;

#define _ADFLTR0                0x01
#define _ADFLTR1                0x02
#define _ADFLTR2                0x04
#define _ADFLTR3                0x08
#define _ADFLTR4                0x10
#define _ADFLTR5                0x20
#define _ADFLTR6                0x40
#define _ADFLTR7                0x80

//==============================================================================


//==============================================================================
//        ADFLTRH Bits

extern __at(0x0115) __sfr ADFLTRH;

typedef struct
  {
  unsigned ADFLTR8              : 1;
  unsigned ADFLTR9              : 1;
  unsigned ADFLTR10             : 1;
  unsigned ADFLTR11             : 1;
  unsigned ADFLTR12             : 1;
  unsigned ADFLTR13             : 1;
  unsigned ADFLTR14             : 1;
  unsigned ADFLTR15             : 1;
  } __ADFLTRHbits_t;

extern __at(0x0115) volatile __ADFLTRHbits_t ADFLTRHbits;

#define _ADFLTR8                0x01
#define _ADFLTR9                0x02
#define _ADFLTR10               0x04
#define _ADFLTR11               0x08
#define _ADFLTR12               0x10
#define _ADFLTR13               0x20
#define _ADFLTR14               0x40
#define _ADFLTR15               0x80

//==============================================================================

extern __at(0x0116) __sfr ADERR;

//==============================================================================
//        ADERRL Bits

extern __at(0x0116) __sfr ADERRL;

typedef struct
  {
  unsigned ADERR0               : 1;
  unsigned ADERR1               : 1;
  unsigned ADERR2               : 1;
  unsigned ADERR3               : 1;
  unsigned ADERR4               : 1;
  unsigned ADERR5               : 1;
  unsigned ADERR6               : 1;
  unsigned ADERR7               : 1;
  } __ADERRLbits_t;

