OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define _T1GCON_GVAL            0x04
#define _T1GCON_T1GVAL          0x04
#define _T1GCON_GGO_NOT_DONE    0x08
#define _T1GCON_T1GGO_NOT_DONE  0x08
#define _T1GCON_T1GGO           0x08
#define _T1GCON_GSPM            0x10
#define _T1GCON_T1GSPM          0x10
#define _T1GCON_GTM             0x20
#define _T1GCON_T1GTM           0x20
#define _T1GCON_GPOL            0x40
#define _T1GCON_T1GPOL          0x40
#define _T1GCON_GE              0x80
#define _T1GCON_T1GE            0x80

//==============================================================================


//==============================================================================
//        T1GATE Bits

extern __at(0x0210) __sfr T1GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1GSS0             : 1;
    unsigned T1GSS1             : 1;
    unsigned T1GSS2             : 1;
    unsigned T1GSS3             : 1;
    unsigned T1GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T1GSS              : 5;
    unsigned                    : 3;
    };
  } __T1GATEbits_t;

extern __at(0x0210) volatile __T1GATEbits_t T1GATEbits;

#define _GSS0                   0x01
#define _T1GSS0                 0x01
#define _GSS1                   0x02
#define _T1GSS1                 0x02
#define _GSS2                   0x04
#define _T1GSS2                 0x04
#define _GSS3                   0x08
#define _T1GSS3                 0x08
#define _GSS4                   0x10
#define _T1GSS4                 0x10

//==============================================================================


//==============================================================================
//        TMR1GATE Bits

extern __at(0x0210) __sfr TMR1GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1GSS0             : 1;
    unsigned T1GSS1             : 1;
    unsigned T1GSS2             : 1;
    unsigned T1GSS3             : 1;
    unsigned T1GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1GSS              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };
  } __TMR1GATEbits_t;

extern __at(0x0210) volatile __TMR1GATEbits_t TMR1GATEbits;

#define _TMR1GATE_GSS0          0x01
#define _TMR1GATE_T1GSS0        0x01
#define _TMR1GATE_GSS1          0x02
#define _TMR1GATE_T1GSS1        0x02
#define _TMR1GATE_GSS2          0x04
#define _TMR1GATE_T1GSS2        0x04
#define _TMR1GATE_GSS3          0x08
#define _TMR1GATE_T1GSS3        0x08
#define _TMR1GATE_GSS4          0x10
#define _TMR1GATE_T1GSS4        0x10

//==============================================================================


//==============================================================================
//        T1CLK Bits

extern __at(0x0211) __sfr T1CLK;

typedef union
  {
  struct
    {
    unsigned T1CS0              : 1;
    unsigned T1CS1              : 1;
    unsigned T1CS2              : 1;
    unsigned T1CS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned CS3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1CS               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CS                 : 4;
    unsigned                    : 4;
    };
  } __T1CLKbits_t;

extern __at(0x0211) volatile __T1CLKbits_t T1CLKbits;

#define _T1CS0                  0x01
#define _CS0                    0x01
#define _T1CS1                  0x02
#define _CS1                    0x02
#define _T1CS2                  0x04
#define _CS2                    0x04
#define _T1CS3                  0x08
#define _CS3                    0x08

//==============================================================================


//==============================================================================
//        TMR1CLK Bits

extern __at(0x0211) __sfr TMR1CLK;

typedef union
  {
  struct
    {
    unsigned T1CS0              : 1;
    unsigned T1CS1              : 1;
    unsigned T1CS2              : 1;
    unsigned T1CS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned CS3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1CS               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CS                 : 4;
    unsigned                    : 4;
    };
  } __TMR1CLKbits_t;

extern __at(0x0211) volatile __TMR1CLKbits_t TMR1CLKbits;

