OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0216) volatile __T3GATEbits_t T3GATEbits;

#define _T3GATE_GSS0            0x01
#define _T3GATE_T3GSS0          0x01
#define _T3GATE_GSS1            0x02
#define _T3GATE_T3GSS1          0x02
#define _T3GATE_GSS2            0x04
#define _T3GATE_T3GSS2          0x04
#define _T3GATE_GSS3            0x08
#define _T3GATE_T3GSS3          0x08
#define _T3GATE_GSS4            0x10
#define _T3GATE_T3GSS4          0x10

//==============================================================================


//==============================================================================
//        TMR3GATE Bits

extern __at(0x0216) __sfr TMR3GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T3GSS0             : 1;
    unsigned T3GSS1             : 1;
    unsigned T3GSS2             : 1;
    unsigned T3GSS3             : 1;
    unsigned T3GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T3GSS              : 5;
    unsigned                    : 3;
    };
  } __TMR3GATEbits_t;

extern __at(0x0216) volatile __TMR3GATEbits_t TMR3GATEbits;

#define _TMR3GATE_GSS0          0x01
#define _TMR3GATE_T3GSS0        0x01
#define _TMR3GATE_GSS1          0x02
#define _TMR3GATE_T3GSS1        0x02
#define _TMR3GATE_GSS2          0x04
#define _TMR3GATE_T3GSS2        0x04
#define _TMR3GATE_GSS3          0x08
#define _TMR3GATE_T3GSS3        0x08
#define _TMR3GATE_GSS4          0x10
#define _TMR3GATE_T3GSS4        0x10

//==============================================================================


//==============================================================================
//        T3CLK Bits

extern __at(0x0217) __sfr T3CLK;

typedef union
  {
  struct
    {
    unsigned T3CS0              : 1;
    unsigned T3CS1              : 1;
    unsigned T3CS2              : 1;
    unsigned T3CS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned CS3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS                 : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T3CS               : 4;
    unsigned                    : 4;
    };
  } __T3CLKbits_t;

extern __at(0x0217) volatile __T3CLKbits_t T3CLKbits;

#define _T3CLK_T3CS0            0x01
#define _T3CLK_CS0              0x01
#define _T3CLK_T3CS1            0x02
#define _T3CLK_CS1              0x02
#define _T3CLK_T3CS2            0x04
#define _T3CLK_CS2              0x04
#define _T3CLK_T3CS3            0x08
#define _T3CLK_CS3              0x08

//==============================================================================


//==============================================================================
//        TMR3CLK Bits

extern __at(0x0217) __sfr TMR3CLK;

typedef union
  {
  struct
    {
    unsigned T3CS0              : 1;
    unsigned T3CS1              : 1;
    unsigned T3CS2              : 1;
    unsigned T3CS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned CS2                : 1;
    unsigned CS3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS                 : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T3CS               : 4;
    unsigned                    : 4;
    };
  } __TMR3CLKbits_t;

extern __at(0x0217) volatile __TMR3CLKbits_t TMR3CLKbits;

#define _TMR3CLK_T3CS0          0x01
#define _TMR3CLK_CS0            0x01
#define _TMR3CLK_T3CS1          0x02
#define _TMR3CLK_CS1            0x02
#define _TMR3CLK_T3CS2          0x04
#define _TMR3CLK_CS2            0x04
#define _TMR3CLK_T3CS3          0x08
#define _TMR3CLK_CS3            0x08

//==============================================================================


//==============================================================================
//        TMR5L Bits

extern __at(0x0218) __sfr TMR5L;

typedef struct
  {
  unsigned TMR5L0               : 1;
  unsigned TMR5L1               : 1;
  unsigned TMR5L2               : 1;
  unsigned TMR5L3               : 1;
  unsigned TMR5L4               : 1;
  unsigned TMR5L5               : 1;
  unsigned TMR5L6               : 1;
  unsigned TMR5L7               : 1;
  } __TMR5Lbits_t;

extern __at(0x0218) volatile __TMR5Lbits_t TMR5Lbits;

#define _TMR5L0                 0x01
#define _TMR5L1                 0x02
#define _TMR5L2                 0x04
#define _TMR5L3                 0x08
#define _TMR5L4                 0x10
#define _TMR5L5                 0x20
#define _TMR5L6                 0x40
#define _TMR5L7                 0x80

//==============================================================================


//==============================================================================
//        TMR5H Bits

extern __at(0x0219) __sfr TMR5H;

typedef struct
  {
  unsigned TMR5H0               : 1;
  unsigned TMR5H1               : 1;
  unsigned TMR5H2               : 1;
  unsigned TMR5H3               : 1;
  unsigned TMR5H4               : 1;
  unsigned TMR5H5               : 1;
  unsigned TMR5H6               : 1;
  unsigned TMR5H7               : 1;
  } __TMR5Hbits_t;

extern __at(0x0219) volatile __TMR5Hbits_t TMR5Hbits;

#define _TMR5H0                 0x01
#define _TMR5H1                 0x02
#define _TMR5H2                 0x04
#define _TMR5H3                 0x08
#define _TMR5H4                 0x10
#define _TMR5H5                 0x20
#define _TMR5H6                 0x40
#define _TMR5H7                 0x80

//==============================================================================


//==============================================================================
//        T5CON Bits

extern __at(0x021A) __sfr T5CON;

typedef union
  {
  struct
    {
    unsigned ON                 : 1;
    unsigned RD16               : 1;
    unsigned NOT_SYNC           : 1;
    unsigned                    : 1;
    unsigned T5CKPS0            : 1;
    unsigned T5CKPS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TMR5ON             : 1;
    unsigned T5RD16             : 1;
    unsigned NOT_T5SYNC         : 1;
    unsigned                    : 1;
    unsigned CKPS0              : 1;
    unsigned CKPS1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CKPS               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T5CKPS             : 2;
    unsigned                    : 2;
    };
  } __T5CONbits_t;

