OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x021A) volatile __T5CONbits_t T5CONbits;

#define _T5CON_ON               0x01
#define _T5CON_TMR5ON           0x01
#define _T5CON_RD16             0x02
#define _T5CON_T5RD16           0x02
#define _T5CON_NOT_SYNC         0x04
#define _T5CON_NOT_T5SYNC       0x04
#define _T5CON_T5CKPS0          0x10
#define _T5CON_CKPS0            0x10
#define _T5CON_T5CKPS1          0x20
#define _T5CON_CKPS1            0x20

//==============================================================================


//==============================================================================
//        PR5 Bits

extern __at(0x021B) __sfr PR5;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5GVAL             : 1;
    unsigned T5GGO_NOT_DONE     : 1;
    unsigned T5GSPM             : 1;
    unsigned T5GTM              : 1;
    unsigned T5GPOL             : 1;
    unsigned T5GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PR5bits_t;

extern __at(0x021B) volatile __PR5bits_t PR5bits;

#define _PR5_GVAL               0x04
#define _PR5_T5GVAL             0x04
#define _PR5_GGO_NOT_DONE       0x08
#define _PR5_T5GGO_NOT_DONE     0x08
#define _PR5_T5GGO              0x08
#define _PR5_GSPM               0x10
#define _PR5_T5GSPM             0x10
#define _PR5_GTM                0x20
#define _PR5_T5GTM              0x20
#define _PR5_GPOL               0x40
#define _PR5_T5GPOL             0x40
#define _PR5_GE                 0x80
#define _PR5_T5GE               0x80

//==============================================================================


//==============================================================================
//        T5GCON Bits

extern __at(0x021B) __sfr T5GCON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5GVAL             : 1;
    unsigned T5GGO_NOT_DONE     : 1;
    unsigned T5GSPM             : 1;
    unsigned T5GTM              : 1;
    unsigned T5GPOL             : 1;
    unsigned T5GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __T5GCONbits_t;

extern __at(0x021B) volatile __T5GCONbits_t T5GCONbits;

#define _T5GCON_GVAL            0x04
#define _T5GCON_T5GVAL          0x04
#define _T5GCON_GGO_NOT_DONE    0x08
#define _T5GCON_T5GGO_NOT_DONE  0x08
#define _T5GCON_T5GGO           0x08
#define _T5GCON_GSPM            0x10
#define _T5GCON_T5GSPM          0x10
#define _T5GCON_GTM             0x20
#define _T5GCON_T5GTM           0x20
#define _T5GCON_GPOL            0x40
#define _T5GCON_T5GPOL          0x40
#define _T5GCON_GE              0x80
#define _T5GCON_T5GE            0x80

//==============================================================================


//==============================================================================
//        T5GATE Bits

extern __at(0x021C) __sfr T5GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T5GSS0             : 1;
    unsigned T5GSS1             : 1;
    unsigned T5GSS2             : 1;
    unsigned T5GSS3             : 1;
    unsigned T5GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T5GSS              : 5;
    unsigned                    : 3;
    };
  } __T5GATEbits_t;

extern __at(0x021C) volatile __T5GATEbits_t T5GATEbits;

#define _T5GATE_GSS0            0x01
#define _T5GATE_T5GSS0          0x01
#define _T5GATE_GSS1            0x02
#define _T5GATE_T5GSS1          0x02
#define _T5GATE_GSS2            0x04
#define _T5GATE_T5GSS2          0x04
#define _T5GATE_GSS3            0x08
#define _T5GATE_T5GSS3          0x08
#define _T5GATE_GSS4            0x10
#define _T5GATE_T5GSS4          0x10

//==============================================================================


//==============================================================================
//        TMR5GATE Bits

extern __at(0x021C) __sfr TMR5GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T5GSS0             : 1;
    unsigned T5GSS1             : 1;
    unsigned T5GSS2             : 1;
    unsigned T5GSS3             : 1;
    unsigned T5GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T5GSS              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };
  } __TMR5GATEbits_t;

extern __at(0x021C) volatile __TMR5GATEbits_t TMR5GATEbits;

#define _TMR5GATE_GSS0          0x01
#define _TMR5GATE_T5GSS0        0x01
#define _TMR5GATE_GSS1          0x02
#define _TMR5GATE_T5GSS1        0x02
#define _TMR5GATE_GSS2          0x04
#define _TMR5GATE_T5GSS2        0x04
#define _TMR5GATE_GSS3          0x08
#define _TMR5GATE_T5GSS3        0x08
#define _TMR5GATE_GSS4          0x10
#define _TMR5GATE_T5GSS4        0x10

//==============================================================================


//==============================================================================
//        T5CLK Bits

