OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x071E) __sfr PIE8;

typedef struct
  {
  unsigned SMT1IE               : 1;
  unsigned SMT1PRAIE            : 1;
  unsigned SMT1PWAIE            : 1;
  unsigned SMT2IE               : 1;
  unsigned SMT2PRAIE            : 1;
  unsigned SMT2PWAIE            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PIE8bits_t;

extern __at(0x071E) volatile __PIE8bits_t PIE8bits;

#define _SMT1IE                 0x01
#define _SMT1PRAIE              0x02
#define _SMT1PWAIE              0x04
#define _SMT2IE                 0x08
#define _SMT2PRAIE              0x10
#define _SMT2PWAIE              0x20

//==============================================================================


//==============================================================================
//        PMD0 Bits

extern __at(0x0796) __sfr PMD0;

typedef struct
  {
  unsigned IOCMD                : 1;
  unsigned CLKRMD               : 1;
  unsigned NVMMD                : 1;
  unsigned SCANMD               : 1;
  unsigned CRCMD                : 1;
  unsigned                      : 1;
  unsigned FVRMD                : 1;
  unsigned SYSCMD               : 1;
  } __PMD0bits_t;

extern __at(0x0796) volatile __PMD0bits_t PMD0bits;

#define _IOCMD                  0x01
#define _CLKRMD                 0x02
#define _NVMMD                  0x04
#define _SCANMD                 0x08
#define _CRCMD                  0x10
#define _FVRMD                  0x40
#define _SYSCMD                 0x80

//==============================================================================


//==============================================================================
//        PMD1 Bits

extern __at(0x0797) __sfr PMD1;

typedef union
  {
  struct
    {
    unsigned TMR0MD             : 1;
    unsigned TMR1MD             : 1;
    unsigned TMR2MD             : 1;
    unsigned TMR3MD             : 1;
    unsigned TMR4MD             : 1;
    unsigned TMR5MD             : 1;
    unsigned TMR6MD             : 1;
    unsigned NCOMD              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NCO1MD             : 1;
    };
  } __PMD1bits_t;

extern __at(0x0797) volatile __PMD1bits_t PMD1bits;

#define _TMR0MD                 0x01
#define _TMR1MD                 0x02
#define _TMR2MD                 0x04
#define _TMR3MD                 0x08
#define _TMR4MD                 0x10
#define _TMR5MD                 0x20
#define _TMR6MD                 0x40
#define _NCOMD                  0x80
#define _NCO1MD                 0x80

//==============================================================================


//==============================================================================
//        PMD2 Bits

extern __at(0x0798) __sfr PMD2;

typedef struct
  {
  unsigned ZCDMD                : 1;
  unsigned CMP1MD               : 1;
  unsigned CMP2MD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ADCMD                : 1;
  unsigned DACMD                : 1;
  unsigned                      : 1;
  } __PMD2bits_t;

extern __at(0x0798) volatile __PMD2bits_t PMD2bits;

#define _ZCDMD                  0x01
#define _CMP1MD                 0x02
#define _CMP2MD                 0x04
#define _ADCMD                  0x20
#define _DACMD                  0x40

//==============================================================================


//==============================================================================
//        PMD3 Bits

extern __at(0x0799) __sfr PMD3;

typedef struct
  {
  unsigned CCP1MD               : 1;
  unsigned CCP2MD               : 1;
  unsigned CCP3MD               : 1;
  unsigned CCP4MD               : 1;
  unsigned CCP5MD               : 1;
  unsigned PWM6MD               : 1;
  unsigned PWM7MD               : 1;
  unsigned                      : 1;
  } __PMD3bits_t;

extern __at(0x0799) volatile __PMD3bits_t PMD3bits;

#define _CCP1MD                 0x01
#define _CCP2MD                 0x02
#define _CCP3MD                 0x04
#define _CCP4MD                 0x08
#define _CCP5MD                 0x10
#define _PWM6MD                 0x20
#define _PWM7MD                 0x40

//==============================================================================


//==============================================================================
//        PMD4 Bits

extern __at(0x079A) __sfr PMD4;

typedef struct
  {
  unsigned CWG1MD               : 1;
  unsigned CWG2MD               : 1;
  unsigned CWG3MD               : 1;
  unsigned                      : 1;
  unsigned MSSP1MD              : 1;
  unsigned MSSP2MD              : 1;
  unsigned UART1MD              : 1;
  unsigned                      : 1;
  } __PMD4bits_t;

extern __at(0x079A) volatile __PMD4bits_t PMD4bits;

#define _CWG1MD                 0x01
#define _CWG2MD                 0x02
#define _CWG3MD                 0x04
#define _MSSP1MD                0x10
#define _MSSP2MD                0x20
#define _UART1MD                0x40

//==============================================================================


//==============================================================================
//        PMD5 Bits

extern __at(0x079B) __sfr PMD5;

typedef struct
  {
  unsigned DSMMD                : 1;
  unsigned CLC1MD               : 1;
  unsigned CLC2MD               : 1;
  unsigned CLC3MD               : 1;
  unsigned CLC4MD               : 1;
  unsigned                      : 1;
  unsigned SMT1MD               : 1;
  unsigned SMT2MD               : 1;
  } __PMD5bits_t;

extern __at(0x079B) volatile __PMD5bits_t PMD5bits;

#define _DSMMD                  0x01
#define _CLC1MD                 0x02
#define _CLC2MD                 0x04
#define _CLC3MD                 0x08
#define _CLC4MD                 0x10
#define _SMT1MD                 0x40
#define _SMT2MD                 0x80

//==============================================================================


//==============================================================================
//        WDTCON0 Bits

