OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0F10) volatile __RA0PPSbits_t RA0PPSbits;

#define _RA0PPS0                0x01
#define _RA0PPS1                0x02
#define _RA0PPS2                0x04
#define _RA0PPS3                0x08
#define _RA0PPS4                0x10
#define _RA0PPS5                0x20

//==============================================================================


//==============================================================================
//        RA1PPS Bits

extern __at(0x0F11) __sfr RA1PPS;

typedef union
  {
  struct
    {
    unsigned RA1PPS0            : 1;
    unsigned RA1PPS1            : 1;
    unsigned RA1PPS2            : 1;
    unsigned RA1PPS3            : 1;
    unsigned RA1PPS4            : 1;
    unsigned RA1PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA1PPS             : 6;
    unsigned                    : 2;
    };
  } __RA1PPSbits_t;

extern __at(0x0F11) volatile __RA1PPSbits_t RA1PPSbits;

#define _RA1PPS0                0x01
#define _RA1PPS1                0x02
#define _RA1PPS2                0x04
#define _RA1PPS3                0x08
#define _RA1PPS4                0x10
#define _RA1PPS5                0x20

//==============================================================================


//==============================================================================
//        RA2PPS Bits

extern __at(0x0F12) __sfr RA2PPS;

typedef union
  {
  struct
    {
    unsigned RA2PPS0            : 1;
    unsigned RA2PPS1            : 1;
    unsigned RA2PPS2            : 1;
    unsigned RA2PPS3            : 1;
    unsigned RA2PPS4            : 1;
    unsigned RA2PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA2PPS             : 6;
    unsigned                    : 2;
    };
  } __RA2PPSbits_t;

extern __at(0x0F12) volatile __RA2PPSbits_t RA2PPSbits;

#define _RA2PPS0                0x01
#define _RA2PPS1                0x02
#define _RA2PPS2                0x04
#define _RA2PPS3                0x08
#define _RA2PPS4                0x10
#define _RA2PPS5                0x20

//==============================================================================


//==============================================================================
//        RA3PPS Bits

extern __at(0x0F13) __sfr RA3PPS;

typedef union
  {
  struct
    {
    unsigned RA3PPS0            : 1;
    unsigned RA3PPS1            : 1;
    unsigned RA3PPS2            : 1;
    unsigned RA3PPS3            : 1;
    unsigned RA3PPS4            : 1;
    unsigned RA3PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA3PPS             : 6;
    unsigned                    : 2;
    };
  } __RA3PPSbits_t;

extern __at(0x0F13) volatile __RA3PPSbits_t RA3PPSbits;

#define _RA3PPS0                0x01
#define _RA3PPS1                0x02
#define _RA3PPS2                0x04
#define _RA3PPS3                0x08
#define _RA3PPS4                0x10
#define _RA3PPS5                0x20

//==============================================================================


//==============================================================================
//        RA4PPS Bits

extern __at(0x0F14) __sfr RA4PPS;

typedef union
  {
  struct
    {
    unsigned RA4PPS0            : 1;
    unsigned RA4PPS1            : 1;
    unsigned RA4PPS2            : 1;
    unsigned RA4PPS3            : 1;
    unsigned RA4PPS4            : 1;
    unsigned RA4PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA4PPS             : 6;
    unsigned                    : 2;
    };
  } __RA4PPSbits_t;

extern __at(0x0F14) volatile __RA4PPSbits_t RA4PPSbits;

#define _RA4PPS0                0x01
#define _RA4PPS1                0x02
#define _RA4PPS2                0x04
#define _RA4PPS3                0x08
#define _RA4PPS4                0x10
#define _RA4PPS5                0x20

//==============================================================================


//==============================================================================
//        RA5PPS Bits

extern __at(0x0F15) __sfr RA5PPS;

typedef union
  {
  struct
    {
    unsigned RA5PPS0            : 1;
    unsigned RA5PPS1            : 1;
    unsigned RA5PPS2            : 1;
    unsigned RA5PPS3            : 1;
    unsigned RA5PPS4            : 1;
    unsigned RA5PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA5PPS             : 6;
    unsigned                    : 2;
    };
  } __RA5PPSbits_t;

extern __at(0x0F15) volatile __RA5PPSbits_t RA5PPSbits;

#define _RA5PPS0                0x01
#define _RA5PPS1                0x02
#define _RA5PPS2                0x04
#define _RA5PPS3                0x08
#define _RA5PPS4                0x10
#define _RA5PPS5                0x20

//==============================================================================


//==============================================================================
//        RA6PPS Bits

extern __at(0x0F16) __sfr RA6PPS;

typedef union
  {
  struct
    {
    unsigned RA6PPS0            : 1;
    unsigned RA6PPS1            : 1;
    unsigned RA6PPS2            : 1;
    unsigned RA6PPS3            : 1;
    unsigned RA6PPS4            : 1;
    unsigned RA6PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA6PPS             : 6;
    unsigned                    : 2;
    };
  } __RA6PPSbits_t;

extern __at(0x0F16) volatile __RA6PPSbits_t RA6PPSbits;

#define _RA6PPS0                0x01
#define _RA6PPS1                0x02
#define _RA6PPS2                0x04
#define _RA6PPS3                0x08
#define _RA6PPS4                0x10
#define _RA6PPS5                0x20

//==============================================================================


//==============================================================================
//        RA7PPS Bits

extern __at(0x0F17) __sfr RA7PPS;

typedef union
  {
  struct
    {
    unsigned RA7PPS0            : 1;
    unsigned RA7PPS1            : 1;
    unsigned RA7PPS2            : 1;
    unsigned RA7PPS3            : 1;
    unsigned RA7PPS4            : 1;
    unsigned RA7PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RA7PPS             : 6;
    unsigned                    : 2;
    };
  } __RA7PPSbits_t;

extern __at(0x0F17) volatile __RA7PPSbits_t RA7PPSbits;

#define _RA7PPS0                0x01
#define _RA7PPS1                0x02
#define _RA7PPS2                0x04
#define _RA7PPS3                0x08
#define _RA7PPS4                0x10
#define _RA7PPS5                0x20

//==============================================================================


//==============================================================================
//        RB0PPS Bits

extern __at(0x0F18) __sfr RB0PPS;

typedef union
  {
  struct
    {
    unsigned RB0PPS0            : 1;
    unsigned RB0PPS1            : 1;
    unsigned RB0PPS2            : 1;
    unsigned RB0PPS3            : 1;
    unsigned RB0PPS4            : 1;
    unsigned RB0PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RB0PPS             : 6;
    unsigned                    : 2;
    };
  } __RB0PPSbits_t;

