OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0F27) __sfr RC7PPS;

typedef union
  {
  struct
    {
    unsigned RC7PPS0            : 1;
    unsigned RC7PPS1            : 1;
    unsigned RC7PPS2            : 1;
    unsigned RC7PPS3            : 1;
    unsigned RC7PPS4            : 1;
    unsigned RC7PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RC7PPS             : 6;
    unsigned                    : 2;
    };
  } __RC7PPSbits_t;

extern __at(0x0F27) volatile __RC7PPSbits_t RC7PPSbits;

#define _RC7PPS0                0x01
#define _RC7PPS1                0x02
#define _RC7PPS2                0x04
#define _RC7PPS3                0x08
#define _RC7PPS4                0x10
#define _RC7PPS5                0x20

//==============================================================================


//==============================================================================
//        RD0PPS Bits

extern __at(0x0F28) __sfr RD0PPS;

typedef union
  {
  struct
    {
    unsigned RD0PPS0            : 1;
    unsigned RD0PPS1            : 1;
    unsigned RD0PPS2            : 1;
    unsigned RD0PPS3            : 1;
    unsigned RD0PPS4            : 1;
    unsigned RD0PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD0PPS             : 6;
    unsigned                    : 2;
    };
  } __RD0PPSbits_t;

extern __at(0x0F28) volatile __RD0PPSbits_t RD0PPSbits;

#define _RD0PPS0                0x01
#define _RD0PPS1                0x02
#define _RD0PPS2                0x04
#define _RD0PPS3                0x08
#define _RD0PPS4                0x10
#define _RD0PPS5                0x20

//==============================================================================


//==============================================================================
//        RD1PPS Bits

extern __at(0x0F29) __sfr RD1PPS;

typedef union
  {
  struct
    {
    unsigned RD1PPS0            : 1;
    unsigned RD1PPS1            : 1;
    unsigned RD1PPS2            : 1;
    unsigned RD1PPS3            : 1;
    unsigned RD1PPS4            : 1;
    unsigned RD1PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD1PPS             : 6;
    unsigned                    : 2;
    };
  } __RD1PPSbits_t;

extern __at(0x0F29) volatile __RD1PPSbits_t RD1PPSbits;

#define _RD1PPS0                0x01
#define _RD1PPS1                0x02
#define _RD1PPS2                0x04
#define _RD1PPS3                0x08
#define _RD1PPS4                0x10
#define _RD1PPS5                0x20

//==============================================================================


//==============================================================================
//        RD2PPS Bits

extern __at(0x0F2A) __sfr RD2PPS;

typedef union
  {
  struct
    {
    unsigned RD2PPS0            : 1;
    unsigned RD2PPS1            : 1;
    unsigned RD2PPS2            : 1;
    unsigned RD2PPS3            : 1;
    unsigned RD2PPS4            : 1;
    unsigned RD2PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD2PPS             : 6;
    unsigned                    : 2;
    };
  } __RD2PPSbits_t;

extern __at(0x0F2A) volatile __RD2PPSbits_t RD2PPSbits;

#define _RD2PPS0                0x01
#define _RD2PPS1                0x02
#define _RD2PPS2                0x04
#define _RD2PPS3                0x08
#define _RD2PPS4                0x10
#define _RD2PPS5                0x20

//==============================================================================


//==============================================================================
//        RD3PPS Bits

extern __at(0x0F2B) __sfr RD3PPS;

typedef union
  {
  struct
    {
    unsigned RD3PPS0            : 1;
    unsigned RD3PPS1            : 1;
    unsigned RD3PPS2            : 1;
    unsigned RD3PPS3            : 1;
    unsigned RD3PPS4            : 1;
    unsigned RD3PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD3PPS             : 6;
    unsigned                    : 2;
    };
  } __RD3PPSbits_t;

extern __at(0x0F2B) volatile __RD3PPSbits_t RD3PPSbits;

#define _RD3PPS0                0x01
#define _RD3PPS1                0x02
#define _RD3PPS2                0x04
#define _RD3PPS3                0x08
#define _RD3PPS4                0x10
#define _RD3PPS5                0x20

//==============================================================================


//==============================================================================
//        RD4PPS Bits

extern __at(0x0F2C) __sfr RD4PPS;

typedef union
  {
  struct
    {
    unsigned RD4PPS0            : 1;
    unsigned RD4PPS1            : 1;
    unsigned RD4PPS2            : 1;
    unsigned RD4PPS3            : 1;
    unsigned RD4PPS4            : 1;
    unsigned RD4PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD4PPS             : 6;
    unsigned                    : 2;
    };
  } __RD4PPSbits_t;

extern __at(0x0F2C) volatile __RD4PPSbits_t RD4PPSbits;

#define _RD4PPS0                0x01
#define _RD4PPS1                0x02
#define _RD4PPS2                0x04
#define _RD4PPS3                0x08
#define _RD4PPS4                0x10
#define _RD4PPS5                0x20

//==============================================================================


//==============================================================================
//        RD5PPS Bits

extern __at(0x0F2D) __sfr RD5PPS;

typedef union
  {
  struct
    {
    unsigned RD5PPS0            : 1;
    unsigned RD5PPS1            : 1;
    unsigned RD5PPS2            : 1;
    unsigned RD5PPS3            : 1;
    unsigned RD5PPS4            : 1;
    unsigned RD5PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD5PPS             : 6;
    unsigned                    : 2;
    };
  } __RD5PPSbits_t;

extern __at(0x0F2D) volatile __RD5PPSbits_t RD5PPSbits;

#define _RD5PPS0                0x01
#define _RD5PPS1                0x02
#define _RD5PPS2                0x04
#define _RD5PPS3                0x08
#define _RD5PPS4                0x10
#define _RD5PPS5                0x20

//==============================================================================


//==============================================================================
//        RD6PPS Bits

extern __at(0x0F2E) __sfr RD6PPS;

typedef union
  {
  struct
    {
    unsigned RD6PPS0            : 1;
    unsigned RD6PPS1            : 1;
    unsigned RD6PPS2            : 1;
    unsigned RD6PPS3            : 1;
    unsigned RD6PPS4            : 1;
    unsigned RD6PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD6PPS             : 6;
    unsigned                    : 2;
    };
  } __RD6PPSbits_t;

extern __at(0x0F2E) volatile __RD6PPSbits_t RD6PPSbits;

