OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
extern __at(0x0F69) volatile __IOCEPbits_t IOCEPbits;

#define _IOCEP3                 0x08

//==============================================================================


//==============================================================================
//        IOCEN Bits

extern __at(0x0F6A) __sfr IOCEN;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCEN3               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __IOCENbits_t;

extern __at(0x0F6A) volatile __IOCENbits_t IOCENbits;

#define _IOCEN3                 0x08

//==============================================================================


//==============================================================================
//        IOCEF Bits

extern __at(0x0F6B) __sfr IOCEF;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCEF3               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __IOCEFbits_t;

extern __at(0x0F6B) volatile __IOCEFbits_t IOCEFbits;

#define _IOCEF3                 0x08

//==============================================================================


//==============================================================================
//        CCDNE Bits

extern __at(0x0F6C) __sfr CCDNE;

typedef union
  {
  struct
    {
    unsigned CCDNE0             : 1;
    unsigned CCDNE1             : 1;
    unsigned CCDNE2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCDNE              : 3;
    unsigned                    : 5;
    };
  } __CCDNEbits_t;

extern __at(0x0F6C) volatile __CCDNEbits_t CCDNEbits;

#define _CCDNE0                 0x01
#define _CCDNE1                 0x02
#define _CCDNE2                 0x04

//==============================================================================


//==============================================================================
//        CCDPE Bits

extern __at(0x0F6D) __sfr CCDPE;

typedef union
  {
  struct
    {
    unsigned CCDPE0             : 1;
    unsigned CCDPE1             : 1;
    unsigned CCDPE2             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCDPE              : 3;
    unsigned                    : 5;
    };
  } __CCDPEbits_t;

extern __at(0x0F6D) volatile __CCDPEbits_t CCDPEbits;

#define _CCDPE0                 0x01
#define _CCDPE1                 0x02
#define _CCDPE2                 0x04

//==============================================================================


//==============================================================================
//        STATUS_SHAD Bits

extern __at(0x0FE4) __sfr STATUS_SHAD;

typedef struct
  {
  unsigned C_SHAD               : 1;
  unsigned DC_SHAD              : 1;
  unsigned Z_SHAD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __STATUS_SHADbits_t;

extern __at(0x0FE4) volatile __STATUS_SHADbits_t STATUS_SHADbits;

#define _C_SHAD                 0x01
#define _DC_SHAD                0x02
#define _Z_SHAD                 0x04

//==============================================================================

extern __at(0x0FE5) __sfr WREG_SHAD;
extern __at(0x0FE6) __sfr BSR_SHAD;
extern __at(0x0FE7) __sfr PCLATH_SHAD;
extern __at(0x0FE8) __sfr FSR0L_SHAD;
extern __at(0x0FE9) __sfr FSR0H_SHAD;
extern __at(0x0FEA) __sfr FSR1L_SHAD;
extern __at(0x0FEB) __sfr FSR1H_SHAD;
extern __at(0x0FED) __sfr STKPTR;
extern __at(0x0FEE) __sfr TOSL;
extern __at(0x0FEF) __sfr TOSH;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG1                0x8007
#define _CONFIG2                0x8008
#define _CONFIG3                0x8009
#define _CONFIG4                0x800A
#define _CONFIG5                0x800B

//----------------------------- CONFIG1 Options -------------------------------

#define _FEXTOSC_LP             0x3FF8  // LP (crystal oscillator) optimized for 32.768kHz; PFM set to low power.
#define _FEXTOSC_XT             0x3FF9  // XT (crystal oscillator) above 500kHz, below 4MHz; PFM set to medium power.
#define _FEXTOSC_HS             0x3FFA  // HS (crystal oscillator) above 4MHz; PFM set to high power.
#define _FEXTOSC_Reserved       0x3FFB  // Reserved.
#define _FEXTOSC_OFF            0x3FFC  // Oscillator not enabled.
#define _FEXTOSC_ECL            0x3FFD  // EC below 500kHz; PFM set to low power.
#define _FEXTOSC_ECM            0x3FFE  // EC for 500kHz to 8MHz; PFM set to medium power.
#define _FEXTOSC_ECH            0x3FFF  // EC above 8MHz; PFM set to high power.
#define _RSTOSC_HFINT32         0x3F8F  // HFINTOSC with OSCFRQ= 32 MHz and CDIV = 1:1.
#define _RSTOSC_HFINTPLL        0x3F9F  // HFINTOSC with 2x PLL, with OSCFRQ = 16 MHz and CDIV = 1:1 (FOSC = 32 MHz).
#define _RSTOSC_EXT4X           0x3FAF  // EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits.
#define _RSTOSC_Reserved        0x3FBF  // Reserved.
#define _RSTOSC_SOSC            0x3FCF  // SOSC.
#define _RSTOSC_LFINT           0x3FDF  // LFINTOSC.
#define _RSTOSC_HFINT1          0x3FEF  // HFINTOSC (1MHz).
#define _RSTOSC_EXT1X           0x3FFF  // EXTOSC operating per FEXTOSC bits.
#define _CLKOUTEN_ON            0x3EFF  // CLKOUT function is enabled; FOSC/4 clock appears at OSC2.
#define _CLKOUTEN_OFF           0x3FFF  // CLKOUT function is disabled; i/o or oscillator function on OSC2.
#define _CSWEN_OFF              0x37FF  // The NOSC and NDIV bits cannot be changed by user software.
#define _CSWEN_ON               0x3FFF  // Writing to NOSC and NDIV is allowed.
#define _FCMEN_OFF              0x1FFF  // FSCM timer disabled.
#define _FCMEN_ON               0x3FFF  // FSCM timer enabled.

//----------------------------- CONFIG2 Options -------------------------------

#define _MCLRE_OFF              0x3FFE  // MCLR pin function is port defined function.
#define _MCLRE_ON               0x3FFF  // MCLR pin is Master Clear function.
#define _PWRTE_ON               0x3FFD  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _LPBOREN_ON             0x3FDF  // ULPBOR enabled.
#define _LPBOREN_OFF            0x3FFF  // ULPBOR disabled.
#define _BOREN_OFF              0x3F3F  // Brown-out reset disabled.
#define _BOREN_SBOREN           0x3F7F  // Brown-out reset enabled according to SBOREN bit.
#define _BOREN_NSLEEP           0x3FBF  // Brown-out Reset enabled while running, disabled in sleep; SBOREN is ignored.
#define _BOREN_ON               0x3FFF  // Brown-out Reset Enabled, SBOREN bit is ignored.
#define _BORV_HI                0x3DFF  // Brown-out Reset Voltage (VBOR) is set to 2.7V.
#define _BORV_LO                0x3FFF  // Brown-out Reset Voltage (VBOR) set to 1.9V on LF, and 2.45V on F Devices.
#define _ZCD_OFF                0x3BFF  // Zero-cross detect circuit is always enabled.
#define _ZCD_ON                 0x3FFF  // Zero-cross detect circuit is disabled at POR.
#define _ZCDDIS_OFF             0x3BFF  // Zero-cross detect circuit is always enabled.
#define _ZCDDIS_ON              0x3FFF  // Zero-cross detect circuit is disabled at POR.
#define _PPS1WAY_OFF            0x37FF  // The PPSLOCK bit can be set and cleared repeatedly by software.
#define _PPS1WAY_ON             0x3FFF  // The PPSLOCK bit can be cleared and set only once in software.
#define _STVREN_OFF             0x2FFF  // Stack Overflow or Underflow will not cause a reset.
#define _STVREN_ON              0x3FFF  // Stack Overflow or Underflow will cause a reset.
#define _DEBUG_ON               0x1FFF  // Background debugger enabled; ICSPCLK and ICSPDAT are dedicated to the debugger.
#define _DEBUG_OFF              0x3FFF  // Background debugger disabled; ICSPCLK and ICSPDAT are general purpose I/O pins.

