OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define ADPREV8                 ADPREVHbits.ADPREV8             // bit 0
#define ADPREV9                 ADPREVHbits.ADPREV9             // bit 1
#define ADPREV10                ADPREVHbits.ADPREV10            // bit 2
#define ADPREV11                ADPREVHbits.ADPREV11            // bit 3
#define ADPREV12                ADPREVHbits.ADPREV12            // bit 4
#define ADPREV13                ADPREVHbits.ADPREV13            // bit 5
#define ADPREV14                ADPREVHbits.ADPREV14            // bit 6
#define ADPREV15                ADPREVHbits.ADPREV15            // bit 7

#define ADPREV0                 ADPREVLbits.ADPREV0             // bit 0
#define ADPREV1                 ADPREVLbits.ADPREV1             // bit 1
#define ADPREV2                 ADPREVLbits.ADPREV2             // bit 2
#define ADPREV3                 ADPREVLbits.ADPREV3             // bit 3
#define ADPREV4                 ADPREVLbits.ADPREV4             // bit 4
#define ADPREV5                 ADPREVLbits.ADPREV5             // bit 5
#define ADPREV6                 ADPREVLbits.ADPREV6             // bit 6
#define ADPREV7                 ADPREVLbits.ADPREV7             // bit 7

#define ADPREF0                 ADREFbits.ADPREF0               // bit 0
#define ADPREF1                 ADREFbits.ADPREF1               // bit 1
#define ADNREF                  ADREFbits.ADNREF                // bit 4

#define ADRPT0                  ADRPTbits.ADRPT0                // bit 0
#define ADRPT1                  ADRPTbits.ADRPT1                // bit 1
#define ADRPT2                  ADRPTbits.ADRPT2                // bit 2
#define ADRPT3                  ADRPTbits.ADRPT3                // bit 3
#define ADRPT4                  ADRPTbits.ADRPT4                // bit 4
#define ADRPT5                  ADRPTbits.ADRPT5                // bit 5
#define ADRPT6                  ADRPTbits.ADRPT6                // bit 6
#define ADRPT7                  ADRPTbits.ADRPT7                // bit 7

#define ADSTAT0                 ADSTATbits.ADSTAT0              // bit 0
#define ADSTAT1                 ADSTATbits.ADSTAT1              // bit 1
#define ADSTAT2                 ADSTATbits.ADSTAT2              // bit 2
#define ADMACT                  ADSTATbits.ADMACT               // bit 3
#define ADMATH                  ADSTATbits.ADMATH               // bit 4
#define ADLTHR                  ADSTATbits.ADLTHR               // bit 5
#define ADUTHR                  ADSTATbits.ADUTHR               // bit 6
#define ADAOV                   ADSTATbits.ADAOV                // bit 7

#define ADSTPT8                 ADSTPTHbits.ADSTPT8             // bit 0
#define ADSTPT9                 ADSTPTHbits.ADSTPT9             // bit 1
#define ADSTPT10                ADSTPTHbits.ADSTPT10            // bit 2
#define ADSTPT11                ADSTPTHbits.ADSTPT11            // bit 3
#define ADSTPT12                ADSTPTHbits.ADSTPT12            // bit 4
#define ADSTPT13                ADSTPTHbits.ADSTPT13            // bit 5
#define ADSTPT14                ADSTPTHbits.ADSTPT14            // bit 6
#define ADSTPT15                ADSTPTHbits.ADSTPT15            // bit 7

#define ADSTPT0                 ADSTPTLbits.ADSTPT0             // bit 0
#define ADSTPT1                 ADSTPTLbits.ADSTPT1             // bit 1
#define ADSTPT2                 ADSTPTLbits.ADSTPT2             // bit 2
#define ADSTPT3                 ADSTPTLbits.ADSTPT3             // bit 3
#define ADSTPT4                 ADSTPTLbits.ADSTPT4             // bit 4
#define ADSTPT5                 ADSTPTLbits.ADSTPT5             // bit 5
#define ADSTPT6                 ADSTPTLbits.ADSTPT6             // bit 6
#define ADSTPT7                 ADSTPTLbits.ADSTPT7             // bit 7

#define ADUTH8                  ADUTHHbits.ADUTH8               // bit 0
#define ADUTH9                  ADUTHHbits.ADUTH9               // bit 1
#define ADUTH10                 ADUTHHbits.ADUTH10              // bit 2
#define ADUTH11                 ADUTHHbits.ADUTH11              // bit 3
#define ADUTH12                 ADUTHHbits.ADUTH12              // bit 4
#define ADUTH13                 ADUTHHbits.ADUTH13              // bit 5
#define ADUTH14                 ADUTHHbits.ADUTH14              // bit 6
#define ADUTH15                 ADUTHHbits.ADUTH15              // bit 7

#define ADUTH0                  ADUTHLbits.ADUTH0               // bit 0
#define ADUTH1                  ADUTHLbits.ADUTH1               // bit 1
#define ADUTH2                  ADUTHLbits.ADUTH2               // bit 2
#define ADUTH3                  ADUTHLbits.ADUTH3               // bit 3
#define ADUTH4                  ADUTHLbits.ADUTH4               // bit 4
#define ADUTH5                  ADUTHLbits.ADUTH5               // bit 5
#define ADUTH6                  ADUTHLbits.ADUTH6               // bit 6
#define ADUTH7                  ADUTHLbits.ADUTH7               // bit 7

#define ANSA0                   ANSELAbits.ANSA0                // bit 0
#define ANSA1                   ANSELAbits.ANSA1                // bit 1
#define ANSA2                   ANSELAbits.ANSA2                // bit 2
#define ANSA3                   ANSELAbits.ANSA3                // bit 3
#define ANSA4                   ANSELAbits.ANSA4                // bit 4
#define ANSA5                   ANSELAbits.ANSA5                // bit 5
#define ANSA6                   ANSELAbits.ANSA6                // bit 6
#define ANSA7                   ANSELAbits.ANSA7                // bit 7

#define ANSB0                   ANSELBbits.ANSB0                // bit 0
#define ANSB1                   ANSELBbits.ANSB1                // bit 1
#define ANSB2                   ANSELBbits.ANSB2                // bit 2
#define ANSB3                   ANSELBbits.ANSB3                // bit 3
#define ANSB4                   ANSELBbits.ANSB4                // bit 4
#define ANSB5                   ANSELBbits.ANSB5                // bit 5
#define ANSB6                   ANSELBbits.ANSB6                // bit 6
#define ANSB7                   ANSELBbits.ANSB7                // bit 7

#define ANSC0                   ANSELCbits.ANSC0                // bit 0
#define ANSC1                   ANSELCbits.ANSC1                // bit 1
#define ANSC2                   ANSELCbits.ANSC2                // bit 2
#define ANSC3                   ANSELCbits.ANSC3                // bit 3
#define ANSC4                   ANSELCbits.ANSC4                // bit 4
#define ANSC5                   ANSELCbits.ANSC5                // bit 5
#define ANSC6                   ANSELCbits.ANSC6                // bit 6
#define ANSC7                   ANSELCbits.ANSC7                // bit 7

#define ANSD0                   ANSELDbits.ANSD0                // bit 0
#define ANSD1                   ANSELDbits.ANSD1                // bit 1
#define ANSD2                   ANSELDbits.ANSD2                // bit 2
#define ANSD3                   ANSELDbits.ANSD3                // bit 3
#define ANSD4                   ANSELDbits.ANSD4                // bit 4
#define ANSD5                   ANSELDbits.ANSD5                // bit 5
#define ANSD6                   ANSELDbits.ANSD6                // bit 6
#define ANSD7                   ANSELDbits.ANSD7                // bit 7

#define ANSE0                   ANSELEbits.ANSE0                // bit 0
#define ANSE1                   ANSELEbits.ANSE1                // bit 1
#define ANSE2                   ANSELEbits.ANSE2                // bit 2

#define ABDEN                   BAUD1CONbits.ABDEN              // bit 0
#define WUE                     BAUD1CONbits.WUE                // bit 1
#define BRG16                   BAUD1CONbits.BRG16              // bit 3
#define SCKP                    BAUD1CONbits.SCKP               // bit 4
#define RCIDL                   BAUD1CONbits.RCIDL              // bit 6
#define ABDOVF                  BAUD1CONbits.ABDOVF             // bit 7

#define BORRDY                  BORCONbits.BORRDY               // bit 0
#define SBOREN                  BORCONbits.SBOREN               // bit 7

#define BSR0                    BSRbits.BSR0                    // bit 0
#define BSR1                    BSRbits.BSR1                    // bit 1
#define BSR2                    BSRbits.BSR2                    // bit 2
#define BSR3                    BSRbits.BSR3                    // bit 3
#define BSR4                    BSRbits.BSR4                    // bit 4

