OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define ODCD0                   ODCONDbits.ODCD0                // bit 0
#define ODCD1                   ODCONDbits.ODCD1                // bit 1
#define ODCD2                   ODCONDbits.ODCD2                // bit 2
#define ODCD3                   ODCONDbits.ODCD3                // bit 3
#define ODCD4                   ODCONDbits.ODCD4                // bit 4
#define ODCD5                   ODCONDbits.ODCD5                // bit 5
#define ODCD6                   ODCONDbits.ODCD6                // bit 6
#define ODCD7                   ODCONDbits.ODCD7                // bit 7

#define ODCE0                   ODCONEbits.ODCE0                // bit 0
#define ODCE1                   ODCONEbits.ODCE1                // bit 1
#define ODCE2                   ODCONEbits.ODCE2                // bit 2

#define NDIV0                   OSCCON1bits.NDIV0               // bit 0
#define NDIV1                   OSCCON1bits.NDIV1               // bit 1
#define NDIV2                   OSCCON1bits.NDIV2               // bit 2
#define NDIV3                   OSCCON1bits.NDIV3               // bit 3
#define NOSC0                   OSCCON1bits.NOSC0               // bit 4
#define NOSC1                   OSCCON1bits.NOSC1               // bit 5
#define NOSC2                   OSCCON1bits.NOSC2               // bit 6

#define CDIV0                   OSCCON2bits.CDIV0               // bit 0
#define CDIV1                   OSCCON2bits.CDIV1               // bit 1
#define CDIV2                   OSCCON2bits.CDIV2               // bit 2
#define CDIV3                   OSCCON2bits.CDIV3               // bit 3
#define COSC0                   OSCCON2bits.COSC0               // bit 4
#define COSC1                   OSCCON2bits.COSC1               // bit 5
#define COSC2                   OSCCON2bits.COSC2               // bit 6

#define NOSCR                   OSCCON3bits.NOSCR               // bit 3
#define ORDY                    OSCCON3bits.ORDY                // bit 4
#define SOSCPWR                 OSCCON3bits.SOSCPWR             // bit 6
#define CSWHOLD                 OSCCON3bits.CSWHOLD             // bit 7

#define ADOEN                   OSCENbits.ADOEN                 // bit 2
#define SOSCEN                  OSCENbits.SOSCEN                // bit 3
#define LFOEN                   OSCENbits.LFOEN                 // bit 4
#define MFOEN                   OSCENbits.MFOEN                 // bit 5
#define HFOEN                   OSCENbits.HFOEN                 // bit 6
#define EXTOEN                  OSCENbits.EXTOEN                // bit 7

#define HFFRQ0                  OSCFRQbits.HFFRQ0               // bit 0
#define HFFRQ1                  OSCFRQbits.HFFRQ1               // bit 1
#define HFFRQ2                  OSCFRQbits.HFFRQ2               // bit 2

#define PLLR                    OSCSTATbits.PLLR                // bit 0
#define ADOR                    OSCSTATbits.ADOR                // bit 2
#define SOR                     OSCSTATbits.SOR                 // bit 3
#define LFOR                    OSCSTATbits.LFOR                // bit 4
#define MFOR                    OSCSTATbits.MFOR                // bit 5
#define HFOR                    OSCSTATbits.HFOR                // bit 6
#define EXTOR                   OSCSTATbits.EXTOR               // bit 7

#define HFTUN0                  OSCTUNEbits.HFTUN0              // bit 0
#define HFTUN1                  OSCTUNEbits.HFTUN1              // bit 1
#define HFTUN2                  OSCTUNEbits.HFTUN2              // bit 2
#define HFTUN3                  OSCTUNEbits.HFTUN3              // bit 3
#define HFTUN4                  OSCTUNEbits.HFTUN4              // bit 4
#define HFTUN5                  OSCTUNEbits.HFTUN5              // bit 5

#define NOT_BOR                 PCON0bits.NOT_BOR               // bit 0
#define NOT_POR                 PCON0bits.NOT_POR               // bit 1
#define NOT_RI                  PCON0bits.NOT_RI                // bit 2
#define NOT_RMCLR               PCON0bits.NOT_RMCLR             // bit 3
#define NOT_RWDT                PCON0bits.NOT_RWDT              // bit 4
#define NOT_WDTWV               PCON0bits.NOT_WDTWV             // bit 5
#define STKUNF                  PCON0bits.STKUNF                // bit 6
#define STKOVF                  PCON0bits.STKOVF                // bit 7

#define INTE                    PIE0bits.INTE                   // bit 0
#define IOCIE                   PIE0bits.IOCIE                  // bit 4
#define TMR0IE                  PIE0bits.TMR0IE                 // bit 5

#define ADIE                    PIE1bits.ADIE                   // bit 0
#define ADTIE                   PIE1bits.ADTIE                  // bit 1
#define CSWIE                   PIE1bits.CSWIE                  // bit 6
#define OSFIE                   PIE1bits.OSFIE                  // bit 7

#define C1IE                    PIE2bits.C1IE                   // bit 0
#define C2IE                    PIE2bits.C2IE                   // bit 1
#define ZCDIE                   PIE2bits.ZCDIE                  // bit 6

#define SSP1IE                  PIE3bits.SSP1IE                 // bit 0
#define BCL1IE                  PIE3bits.BCL1IE                 // bit 1
#define SSP2IE                  PIE3bits.SSP2IE                 // bit 2
#define BCL2IE                  PIE3bits.BCL2IE                 // bit 3
#define TXIE                    PIE3bits.TXIE                   // bit 4
#define RCIE                    PIE3bits.RCIE                   // bit 5

#define TMR1IE                  PIE4bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE4bits.TMR2IE                 // bit 1
#define TMR3IE                  PIE4bits.TMR3IE                 // bit 2
#define TMR4IE                  PIE4bits.TMR4IE                 // bit 3
#define TMR5IE                  PIE4bits.TMR5IE                 // bit 4
#define TMR6IE                  PIE4bits.TMR6IE                 // bit 5

#define TMR1GIE                 PIE5bits.TMR1GIE                // bit 0
#define TMR3GIE                 PIE5bits.TMR3GIE                // bit 1
#define TMR5GIE                 PIE5bits.TMR5GIE                // bit 2
#define CLC1IE                  PIE5bits.CLC1IE                 // bit 4
#define CLC2IE                  PIE5bits.CLC2IE                 // bit 5
#define CLC3IE                  PIE5bits.CLC3IE                 // bit 6
#define CLC4IE                  PIE5bits.CLC4IE                 // bit 7

#define CCP1IE                  PIE6bits.CCP1IE                 // bit 0
#define CCP2IE                  PIE6bits.CCP2IE                 // bit 1
#define CCP3IE                  PIE6bits.CCP3IE                 // bit 2
#define CCP4IE                  PIE6bits.CCP4IE                 // bit 3
#define CCP5IE                  PIE6bits.CCP5IE                 // bit 4

#define CWG1IE                  PIE7bits.CWG1IE                 // bit 0
#define CWG2IE                  PIE7bits.CWG2IE                 // bit 1
#define CWG3IE                  PIE7bits.CWG3IE                 // bit 2
#define NCO1IE                  PIE7bits.NCO1IE                 // bit 4, shadows bit in PIE7bits
#define NCOIE                   PIE7bits.NCOIE                  // bit 4, shadows bit in PIE7bits
#define NVMIE                   PIE7bits.NVMIE                  // bit 5
#define CRCIE                   PIE7bits.CRCIE                  // bit 6
#define SCANIE                  PIE7bits.SCANIE                 // bit 7

#define SMT1IE                  PIE8bits.SMT1IE                 // bit 0
#define SMT1PRAIE               PIE8bits.SMT1PRAIE              // bit 1
#define SMT1PWAIE               PIE8bits.SMT1PWAIE              // bit 2
#define SMT2IE                  PIE8bits.SMT2IE                 // bit 3
#define SMT2PRAIE               PIE8bits.SMT2PRAIE              // bit 4
#define SMT2PWAIE               PIE8bits.SMT2PWAIE              // bit 5

