OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define RX9D                    RC1STAbits.RX9D                 // bit 0
#define OERR                    RC1STAbits.OERR                 // bit 1
#define FERR                    RC1STAbits.FERR                 // bit 2
#define ADDEN                   RC1STAbits.ADDEN                // bit 3
#define CREN                    RC1STAbits.CREN                 // bit 4
#define SREN                    RC1STAbits.SREN                 // bit 5
#define RX9                     RC1STAbits.RX9                  // bit 6
#define SPEN                    RC1STAbits.SPEN                 // bit 7

#define RC2PPS0                 RC2PPSbits.RC2PPS0              // bit 0
#define RC2PPS1                 RC2PPSbits.RC2PPS1              // bit 1
#define RC2PPS2                 RC2PPSbits.RC2PPS2              // bit 2
#define RC2PPS3                 RC2PPSbits.RC2PPS3              // bit 3
#define RC2PPS4                 RC2PPSbits.RC2PPS4              // bit 4
#define RC2PPS5                 RC2PPSbits.RC2PPS5              // bit 5

#define RC3PPS0                 RC3PPSbits.RC3PPS0              // bit 0
#define RC3PPS1                 RC3PPSbits.RC3PPS1              // bit 1
#define RC3PPS2                 RC3PPSbits.RC3PPS2              // bit 2
#define RC3PPS3                 RC3PPSbits.RC3PPS3              // bit 3
#define RC3PPS4                 RC3PPSbits.RC3PPS4              // bit 4
#define RC3PPS5                 RC3PPSbits.RC3PPS5              // bit 5

#define RC4PPS0                 RC4PPSbits.RC4PPS0              // bit 0
#define RC4PPS1                 RC4PPSbits.RC4PPS1              // bit 1
#define RC4PPS2                 RC4PPSbits.RC4PPS2              // bit 2
#define RC4PPS3                 RC4PPSbits.RC4PPS3              // bit 3
#define RC4PPS4                 RC4PPSbits.RC4PPS4              // bit 4
#define RC4PPS5                 RC4PPSbits.RC4PPS5              // bit 5

#define RC5PPS0                 RC5PPSbits.RC5PPS0              // bit 0
#define RC5PPS1                 RC5PPSbits.RC5PPS1              // bit 1
#define RC5PPS2                 RC5PPSbits.RC5PPS2              // bit 2
#define RC5PPS3                 RC5PPSbits.RC5PPS3              // bit 3
#define RC5PPS4                 RC5PPSbits.RC5PPS4              // bit 4
#define RC5PPS5                 RC5PPSbits.RC5PPS5              // bit 5

#define RC6PPS0                 RC6PPSbits.RC6PPS0              // bit 0
#define RC6PPS1                 RC6PPSbits.RC6PPS1              // bit 1
#define RC6PPS2                 RC6PPSbits.RC6PPS2              // bit 2
#define RC6PPS3                 RC6PPSbits.RC6PPS3              // bit 3
#define RC6PPS4                 RC6PPSbits.RC6PPS4              // bit 4
#define RC6PPS5                 RC6PPSbits.RC6PPS5              // bit 5

#define RC7PPS0                 RC7PPSbits.RC7PPS0              // bit 0
#define RC7PPS1                 RC7PPSbits.RC7PPS1              // bit 1
#define RC7PPS2                 RC7PPSbits.RC7PPS2              // bit 2
#define RC7PPS3                 RC7PPSbits.RC7PPS3              // bit 3
#define RC7PPS4                 RC7PPSbits.RC7PPS4              // bit 4
#define RC7PPS5                 RC7PPSbits.RC7PPS5              // bit 5

#define RD0PPS0                 RD0PPSbits.RD0PPS0              // bit 0
#define RD0PPS1                 RD0PPSbits.RD0PPS1              // bit 1
#define RD0PPS2                 RD0PPSbits.RD0PPS2              // bit 2
#define RD0PPS3                 RD0PPSbits.RD0PPS3              // bit 3
#define RD0PPS4                 RD0PPSbits.RD0PPS4              // bit 4
#define RD0PPS5                 RD0PPSbits.RD0PPS5              // bit 5

#define RD1PPS0                 RD1PPSbits.RD1PPS0              // bit 0
#define RD1PPS1                 RD1PPSbits.RD1PPS1              // bit 1
#define RD1PPS2                 RD1PPSbits.RD1PPS2              // bit 2
#define RD1PPS3                 RD1PPSbits.RD1PPS3              // bit 3
#define RD1PPS4                 RD1PPSbits.RD1PPS4              // bit 4
#define RD1PPS5                 RD1PPSbits.RD1PPS5              // bit 5

#define RD2PPS0                 RD2PPSbits.RD2PPS0              // bit 0
#define RD2PPS1                 RD2PPSbits.RD2PPS1              // bit 1
#define RD2PPS2                 RD2PPSbits.RD2PPS2              // bit 2
#define RD2PPS3                 RD2PPSbits.RD2PPS3              // bit 3
#define RD2PPS4                 RD2PPSbits.RD2PPS4              // bit 4
#define RD2PPS5                 RD2PPSbits.RD2PPS5              // bit 5

#define RD3PPS0                 RD3PPSbits.RD3PPS0              // bit 0
#define RD3PPS1                 RD3PPSbits.RD3PPS1              // bit 1
#define RD3PPS2                 RD3PPSbits.RD3PPS2              // bit 2
#define RD3PPS3                 RD3PPSbits.RD3PPS3              // bit 3
#define RD3PPS4                 RD3PPSbits.RD3PPS4              // bit 4
#define RD3PPS5                 RD3PPSbits.RD3PPS5              // bit 5

#define RD4PPS0                 RD4PPSbits.RD4PPS0              // bit 0
#define RD4PPS1                 RD4PPSbits.RD4PPS1              // bit 1
#define RD4PPS2                 RD4PPSbits.RD4PPS2              // bit 2
#define RD4PPS3                 RD4PPSbits.RD4PPS3              // bit 3
#define RD4PPS4                 RD4PPSbits.RD4PPS4              // bit 4
#define RD4PPS5                 RD4PPSbits.RD4PPS5              // bit 5

#define RD5PPS0                 RD5PPSbits.RD5PPS0              // bit 0
#define RD5PPS1                 RD5PPSbits.RD5PPS1              // bit 1
#define RD5PPS2                 RD5PPSbits.RD5PPS2              // bit 2
#define RD5PPS3                 RD5PPSbits.RD5PPS3              // bit 3
#define RD5PPS4                 RD5PPSbits.RD5PPS4              // bit 4
#define RD5PPS5                 RD5PPSbits.RD5PPS5              // bit 5

#define RD6PPS0                 RD6PPSbits.RD6PPS0              // bit 0
#define RD6PPS1                 RD6PPSbits.RD6PPS1              // bit 1
#define RD6PPS2                 RD6PPSbits.RD6PPS2              // bit 2
#define RD6PPS3                 RD6PPSbits.RD6PPS3              // bit 3
#define RD6PPS4                 RD6PPSbits.RD6PPS4              // bit 4
#define RD6PPS5                 RD6PPSbits.RD6PPS5              // bit 5

#define RD7PPS0                 RD7PPSbits.RD7PPS0              // bit 0
#define RD7PPS1                 RD7PPSbits.RD7PPS1              // bit 1
#define RD7PPS2                 RD7PPSbits.RD7PPS2              // bit 2
#define RD7PPS3                 RD7PPSbits.RD7PPS3              // bit 3
#define RD7PPS4                 RD7PPSbits.RD7PPS4              // bit 4
#define RD7PPS5                 RD7PPSbits.RD7PPS5              // bit 5

#define RE0PPS0                 RE0PPSbits.RE0PPS0              // bit 0
#define RE0PPS1                 RE0PPSbits.RE0PPS1              // bit 1
#define RE0PPS2                 RE0PPSbits.RE0PPS2              // bit 2
#define RE0PPS3                 RE0PPSbits.RE0PPS3              // bit 3
#define RE0PPS4                 RE0PPSbits.RE0PPS4              // bit 4
#define RE0PPS5                 RE0PPSbits.RE0PPS5              // bit 5

#define RE1PPS0                 RE1PPSbits.RE1PPS0              // bit 0
#define RE1PPS1                 RE1PPSbits.RE1PPS1              // bit 1
#define RE1PPS2                 RE1PPSbits.RE1PPS2              // bit 2
#define RE1PPS3                 RE1PPSbits.RE1PPS3              // bit 3
#define RE1PPS4                 RE1PPSbits.RE1PPS4              // bit 4
#define RE1PPS5                 RE1PPSbits.RE1PPS5              // bit 5

#define RE2PPS0                 RE2PPSbits.RE2PPS0              // bit 0
#define RE2PPS1                 RE2PPSbits.RE2PPS1              // bit 1
#define RE2PPS2                 RE2PPSbits.RE2PPS2              // bit 2
#define RE2PPS3                 RE2PPSbits.RE2PPS3              // bit 3
#define RE2PPS4                 RE2PPSbits.RE2PPS4              // bit 4
#define RE2PPS5                 RE2PPSbits.RE2PPS5              // bit 5

#define RXPPS0                  RXPPSbits.RXPPS0                // bit 0
#define RXPPS1                  RXPPSbits.RXPPS1                // bit 1
#define RXPPS2                  RXPPSbits.RXPPS2                // bit 2
#define RXPPS3                  RXPPSbits.RXPPS3                // bit 3
#define RXPPS4                  RXPPSbits.RXPPS4                // bit 4

#define HADR8                   SCANHADRHbits.HADR8             // bit 0, shadows bit in SCANHADRHbits
#define SCANHADR8               SCANHADRHbits.SCANHADR8         // bit 0, shadows bit in SCANHADRHbits
#define HADR9                   SCANHADRHbits.HADR9             // bit 1, shadows bit in SCANHADRHbits
#define SCANHADR9               SCANHADRHbits.SCANHADR9         // bit 1, shadows bit in SCANHADRHbits
#define HADR10                  SCANHADRHbits.HADR10            // bit 2, shadows bit in SCANHADRHbits
#define SCANHADR10              SCANHADRHbits.SCANHADR10        // bit 2, shadows bit in SCANHADRHbits
#define HADR11                  SCANHADRHbits.HADR11            // bit 3, shadows bit in SCANHADRHbits
#define SCANHADR11              SCANHADRHbits.SCANHADR11        // bit 3, shadows bit in SCANHADRHbits
#define HADR12                  SCANHADRHbits.HADR12            // bit 4, shadows bit in SCANHADRHbits
#define SCANHADR12              SCANHADRHbits.SCANHADR12        // bit 4, shadows bit in SCANHADRHbits
#define HADR13                  SCANHADRHbits.HADR13            // bit 5, shadows bit in SCANHADRHbits
#define SCANHADR13              SCANHADRHbits.SCANHADR13        // bit 5, shadows bit in SCANHADRHbits
#define HADR14                  SCANHADRHbits.HADR14            // bit 6, shadows bit in SCANHADRHbits
#define SCANHADR14              SCANHADRHbits.SCANHADR14        // bit 6, shadows bit in SCANHADRHbits
#define HADR15                  SCANHADRHbits.HADR15            // bit 7, shadows bit in SCANHADRHbits
#define SCANHADR15              SCANHADRHbits.SCANHADR15        // bit 7, shadows bit in SCANHADRHbits

#define HADR0                   SCANHADRLbits.HADR0             // bit 0, shadows bit in SCANHADRLbits
#define SCANHADR0               SCANHADRLbits.SCANHADR0         // bit 0, shadows bit in SCANHADRLbits
#define HADR1                   SCANHADRLbits.HADR1             // bit 1, shadows bit in SCANHADRLbits
#define SCANHADR1               SCANHADRLbits.SCANHADR1         // bit 1, shadows bit in SCANHADRLbits
#define HADR2                   SCANHADRLbits.HADR2             // bit 2, shadows bit in SCANHADRLbits
#define SCANHADR2               SCANHADRLbits.SCANHADR2         // bit 2, shadows bit in SCANHADRLbits
#define HADR3                   SCANHADRLbits.HADR3             // bit 3, shadows bit in SCANHADRLbits
#define SCANHADR3               SCANHADRLbits.SCANHADR3         // bit 3, shadows bit in SCANHADRLbits
#define HADR4                   SCANHADRLbits.HADR4             // bit 4, shadows bit in SCANHADRLbits
#define SCANHADR4               SCANHADRLbits.SCANHADR4         // bit 4, shadows bit in SCANHADRLbits
#define HADR5                   SCANHADRLbits.HADR5             // bit 5, shadows bit in SCANHADRLbits
#define SCANHADR5               SCANHADRLbits.SCANHADR5         // bit 5, shadows bit in SCANHADRLbits
#define HADR6                   SCANHADRLbits.HADR6             // bit 6, shadows bit in SCANHADRLbits
#define SCANHADR6               SCANHADRLbits.SCANHADR6         // bit 6, shadows bit in SCANHADRLbits
#define HADR7                   SCANHADRLbits.HADR7             // bit 7, shadows bit in SCANHADRLbits
#define SCANHADR7               SCANHADRLbits.SCANHADR7         // bit 7, shadows bit in SCANHADRLbits

#define LADR8                   SCANLADRHbits.LADR8             // bit 0, shadows bit in SCANLADRHbits
#define SCANLADR8               SCANLADRHbits.SCANLADR8         // bit 0, shadows bit in SCANLADRHbits
#define LADR9                   SCANLADRHbits.LADR9             // bit 1, shadows bit in SCANLADRHbits
#define SCANLADR9               SCANLADRHbits.SCANLADR9         // bit 1, shadows bit in SCANLADRHbits
#define LADR10                  SCANLADRHbits.LADR10            // bit 2, shadows bit in SCANLADRHbits
#define SCANLADR10              SCANLADRHbits.SCANLADR10        // bit 2, shadows bit in SCANLADRHbits
#define LADR11                  SCANLADRHbits.LADR11            // bit 3, shadows bit in SCANLADRHbits
#define SCANLADR11              SCANLADRHbits.SCANLADR11        // bit 3, shadows bit in SCANLADRHbits
#define LADR12                  SCANLADRHbits.LADR12            // bit 4, shadows bit in SCANLADRHbits
#define SCANLADR12              SCANLADRHbits.SCANLADR12        // bit 4, shadows bit in SCANLADRHbits
#define LADR13                  SCANLADRHbits.LADR13            // bit 5, shadows bit in SCANLADRHbits
#define SCANLADR13              SCANLADRHbits.SCANLADR13        // bit 5, shadows bit in SCANLADRHbits
#define LADR14                  SCANLADRHbits.LADR14            // bit 6, shadows bit in SCANLADRHbits
#define SCANLADR14              SCANLADRHbits.SCANLADR14        // bit 6, shadows bit in SCANLADRHbits
#define LADR15                  SCANLADRHbits.LADR15            // bit 7, shadows bit in SCANLADRHbits
#define SCANLADR15              SCANLADRHbits.SCANLADR15        // bit 7, shadows bit in SCANLADRHbits

#define LADR0                   SCANLADRLbits.LADR0             // bit 0, shadows bit in SCANLADRLbits
#define SCANLADR0               SCANLADRLbits.SCANLADR0         // bit 0, shadows bit in SCANLADRLbits
#define LADR1                   SCANLADRLbits.LADR1             // bit 1, shadows bit in SCANLADRLbits
#define SCANLADR1               SCANLADRLbits.SCANLADR1         // bit 1, shadows bit in SCANLADRLbits
#define LADR2                   SCANLADRLbits.LADR2             // bit 2, shadows bit in SCANLADRLbits
#define SCANLADR2               SCANLADRLbits.SCANLADR2         // bit 2, shadows bit in SCANLADRLbits
#define LADR3                   SCANLADRLbits.LADR3             // bit 3, shadows bit in SCANLADRLbits
#define SCANLADR3               SCANLADRLbits.SCANLADR3         // bit 3, shadows bit in SCANLADRLbits
#define LADR4                   SCANLADRLbits.LADR4             // bit 4, shadows bit in SCANLADRLbits
#define SCANLADR4               SCANLADRLbits.SCANLADR4         // bit 4, shadows bit in SCANLADRLbits
#define LADR5                   SCANLADRLbits.LADR5             // bit 5, shadows bit in SCANLADRLbits
#define SCANLADR5               SCANLADRLbits.SCANLADR5         // bit 5, shadows bit in SCANLADRLbits
#define LADR6                   SCANLADRLbits.LADR6             // bit 6, shadows bit in SCANLADRLbits
#define SCANLADR6               SCANLADRLbits.SCANLADR6         // bit 6, shadows bit in SCANLADRLbits
#define LADR7                   SCANLADRLbits.LADR7             // bit 7, shadows bit in SCANLADRLbits
#define SCANLADR7               SCANLADRLbits.SCANLADR7         // bit 7, shadows bit in SCANLADRLbits

#define TSEL0                   SCANTRIGbits.TSEL0              // bit 0, shadows bit in SCANTRIGbits
#define SCANTSEL0               SCANTRIGbits.SCANTSEL0          // bit 0, shadows bit in SCANTRIGbits
#define TSEL1                   SCANTRIGbits.TSEL1              // bit 1, shadows bit in SCANTRIGbits
#define SCANTSEL1               SCANTRIGbits.SCANTSEL1          // bit 1, shadows bit in SCANTRIGbits
#define TSEL2                   SCANTRIGbits.TSEL2              // bit 2, shadows bit in SCANTRIGbits
#define SCANTSEL2               SCANTRIGbits.SCANTSEL2          // bit 2, shadows bit in SCANTRIGbits
#define TSEL3                   SCANTRIGbits.TSEL3              // bit 3, shadows bit in SCANTRIGbits
#define SCANTSEL3               SCANTRIGbits.SCANTSEL3          // bit 3, shadows bit in SCANTRIGbits

#define SLRA0                   SLRCONAbits.SLRA0               // bit 0
#define SLRA1                   SLRCONAbits.SLRA1               // bit 1
#define SLRA2                   SLRCONAbits.SLRA2               // bit 2
#define SLRA3                   SLRCONAbits.SLRA3               // bit 3
#define SLRA4                   SLRCONAbits.SLRA4               // bit 4
#define SLRA5                   SLRCONAbits.SLRA5               // bit 5
#define SLRA6                   SLRCONAbits.SLRA6               // bit 6
#define SLRA7                   SLRCONAbits.SLRA7               // bit 7

#define SLRB0                   SLRCONBbits.SLRB0               // bit 0
#define SLRB1                   SLRCONBbits.SLRB1               // bit 1
#define SLRB2                   SLRCONBbits.SLRB2               // bit 2
#define SLRB3                   SLRCONBbits.SLRB3               // bit 3
#define SLRB4                   SLRCONBbits.SLRB4               // bit 4
#define SLRB5                   SLRCONBbits.SLRB5               // bit 5
#define SLRB6                   SLRCONBbits.SLRB6               // bit 6
#define SLRB7                   SLRCONBbits.SLRB7               // bit 7

#define SLRC0                   SLRCONCbits.SLRC0               // bit 0
#define SLRC1                   SLRCONCbits.SLRC1               // bit 1
#define SLRC2                   SLRCONCbits.SLRC2               // bit 2
#define SLRC3                   SLRCONCbits.SLRC3               // bit 3
#define SLRC4                   SLRCONCbits.SLRC4               // bit 4
#define SLRC5                   SLRCONCbits.SLRC5               // bit 5
#define SLRC6                   SLRCONCbits.SLRC6               // bit 6
#define SLRC7                   SLRCONCbits.SLRC7               // bit 7

#define SLRD0                   SLRCONDbits.SLRD0               // bit 0
#define SLRD1                   SLRCONDbits.SLRD1               // bit 1
#define SLRD2                   SLRCONDbits.SLRD2               // bit 2
#define SLRD3                   SLRCONDbits.SLRD3               // bit 3
#define SLRD4                   SLRCONDbits.SLRD4               // bit 4
#define SLRD5                   SLRCONDbits.SLRD5               // bit 5
#define SLRD6                   SLRCONDbits.SLRD6               // bit 6
#define SLRD7                   SLRCONDbits.SLRD7               // bit 7

