OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf18875.h
#define SLRE0                   SLRCONEbits.SLRE0               // bit 0
#define SLRE1                   SLRCONEbits.SLRE1               // bit 1
#define SLRE2                   SLRCONEbits.SLRE2               // bit 2

#define CSEL0                   SMT1CLKbits.CSEL0               // bit 0, shadows bit in SMT1CLKbits
#define SMT1CSEL0               SMT1CLKbits.SMT1CSEL0           // bit 0, shadows bit in SMT1CLKbits
#define CSEL1                   SMT1CLKbits.CSEL1               // bit 1, shadows bit in SMT1CLKbits
#define SMT1CSEL1               SMT1CLKbits.SMT1CSEL1           // bit 1, shadows bit in SMT1CLKbits
#define CSEL2                   SMT1CLKbits.CSEL2               // bit 2, shadows bit in SMT1CLKbits
#define SMT1CSEL2               SMT1CLKbits.SMT1CSEL2           // bit 2, shadows bit in SMT1CLKbits

#define CPR8                    SMT1CPRHbits.CPR8               // bit 0, shadows bit in SMT1CPRHbits
#define SMT1CPR8                SMT1CPRHbits.SMT1CPR8           // bit 0, shadows bit in SMT1CPRHbits
#define CPR9                    SMT1CPRHbits.CPR9               // bit 1, shadows bit in SMT1CPRHbits
#define SMT1CPR9                SMT1CPRHbits.SMT1CPR9           // bit 1, shadows bit in SMT1CPRHbits
#define CPR10                   SMT1CPRHbits.CPR10              // bit 2, shadows bit in SMT1CPRHbits
#define SMT1CPR10               SMT1CPRHbits.SMT1CPR10          // bit 2, shadows bit in SMT1CPRHbits
#define CPR11                   SMT1CPRHbits.CPR11              // bit 3, shadows bit in SMT1CPRHbits
#define SMT1CPR11               SMT1CPRHbits.SMT1CPR11          // bit 3, shadows bit in SMT1CPRHbits
#define CPR12                   SMT1CPRHbits.CPR12              // bit 4, shadows bit in SMT1CPRHbits
#define SMT1CPR12               SMT1CPRHbits.SMT1CPR12          // bit 4, shadows bit in SMT1CPRHbits
#define CPR13                   SMT1CPRHbits.CPR13              // bit 5, shadows bit in SMT1CPRHbits
#define SMT1CPR13               SMT1CPRHbits.SMT1CPR13          // bit 5, shadows bit in SMT1CPRHbits
#define CPR14                   SMT1CPRHbits.CPR14              // bit 6, shadows bit in SMT1CPRHbits
#define SMT1CPR14               SMT1CPRHbits.SMT1CPR14          // bit 6, shadows bit in SMT1CPRHbits
#define CPR15                   SMT1CPRHbits.CPR15              // bit 7, shadows bit in SMT1CPRHbits
#define SMT1CPR15               SMT1CPRHbits.SMT1CPR15          // bit 7, shadows bit in SMT1CPRHbits

#define CPR0                    SMT1CPRLbits.CPR0               // bit 0
#define CPR1                    SMT1CPRLbits.CPR1               // bit 1
#define CPR2                    SMT1CPRLbits.CPR2               // bit 2
#define CPR3                    SMT1CPRLbits.CPR3               // bit 3
#define CPR4                    SMT1CPRLbits.CPR4               // bit 4
#define CPR5                    SMT1CPRLbits.CPR5               // bit 5
#define CPR6                    SMT1CPRLbits.CPR6               // bit 6
#define CPR7                    SMT1CPRLbits.CPR7               // bit 7

#define CPR16                   SMT1CPRUbits.CPR16              // bit 0, shadows bit in SMT1CPRUbits
#define SMT1CPR16               SMT1CPRUbits.SMT1CPR16          // bit 0, shadows bit in SMT1CPRUbits
#define CPR17                   SMT1CPRUbits.CPR17              // bit 1, shadows bit in SMT1CPRUbits
#define SMT1CPR17               SMT1CPRUbits.SMT1CPR17          // bit 1, shadows bit in SMT1CPRUbits
#define CPR18                   SMT1CPRUbits.CPR18              // bit 2, shadows bit in SMT1CPRUbits
#define SMT1CPR18               SMT1CPRUbits.SMT1CPR18          // bit 2, shadows bit in SMT1CPRUbits
#define CPR19                   SMT1CPRUbits.CPR19              // bit 3, shadows bit in SMT1CPRUbits
#define SMT1CPR19               SMT1CPRUbits.SMT1CPR19          // bit 3, shadows bit in SMT1CPRUbits
#define CPR20                   SMT1CPRUbits.CPR20              // bit 4, shadows bit in SMT1CPRUbits
#define SMT1CPR20               SMT1CPRUbits.SMT1CPR20          // bit 4, shadows bit in SMT1CPRUbits
#define CPR21                   SMT1CPRUbits.CPR21              // bit 5, shadows bit in SMT1CPRUbits
#define SMT1CPR21               SMT1CPRUbits.SMT1CPR21          // bit 5, shadows bit in SMT1CPRUbits
#define CPR22                   SMT1CPRUbits.CPR22              // bit 6, shadows bit in SMT1CPRUbits
#define SMT1CPR22               SMT1CPRUbits.SMT1CPR22          // bit 6, shadows bit in SMT1CPRUbits
#define CPR23                   SMT1CPRUbits.CPR23              // bit 7, shadows bit in SMT1CPRUbits
#define SMT1CPR23               SMT1CPRUbits.SMT1CPR23          // bit 7, shadows bit in SMT1CPRUbits

#define CPW8                    SMT1CPWHbits.CPW8               // bit 0, shadows bit in SMT1CPWHbits
#define SMT1CPW8                SMT1CPWHbits.SMT1CPW8           // bit 0, shadows bit in SMT1CPWHbits
#define CPW9                    SMT1CPWHbits.CPW9               // bit 1, shadows bit in SMT1CPWHbits
#define SMT1CPW9                SMT1CPWHbits.SMT1CPW9           // bit 1, shadows bit in SMT1CPWHbits
#define CPW10                   SMT1CPWHbits.CPW10              // bit 2, shadows bit in SMT1CPWHbits
#define SMT1CPW10               SMT1CPWHbits.SMT1CPW10          // bit 2, shadows bit in SMT1CPWHbits
#define CPW11                   SMT1CPWHbits.CPW11              // bit 3, shadows bit in SMT1CPWHbits
#define SMT1CPW11               SMT1CPWHbits.SMT1CPW11          // bit 3, shadows bit in SMT1CPWHbits
#define CPW12                   SMT1CPWHbits.CPW12              // bit 4, shadows bit in SMT1CPWHbits
#define SMT1CPW12               SMT1CPWHbits.SMT1CPW12          // bit 4, shadows bit in SMT1CPWHbits
#define CPW13                   SMT1CPWHbits.CPW13              // bit 5, shadows bit in SMT1CPWHbits
#define SMT1CPW13               SMT1CPWHbits.SMT1CPW13          // bit 5, shadows bit in SMT1CPWHbits
#define CPW14                   SMT1CPWHbits.CPW14              // bit 6, shadows bit in SMT1CPWHbits
#define SMT1CPW14               SMT1CPWHbits.SMT1CPW14          // bit 6, shadows bit in SMT1CPWHbits
#define CPW15                   SMT1CPWHbits.CPW15              // bit 7, shadows bit in SMT1CPWHbits
#define SMT1CPW15               SMT1CPWHbits.SMT1CPW15          // bit 7, shadows bit in SMT1CPWHbits

#define CPW0                    SMT1CPWLbits.CPW0               // bit 0, shadows bit in SMT1CPWLbits
#define SMT1CPW0                SMT1CPWLbits.SMT1CPW0           // bit 0, shadows bit in SMT1CPWLbits
#define CPW1                    SMT1CPWLbits.CPW1               // bit 1, shadows bit in SMT1CPWLbits
#define SMT1CPW1                SMT1CPWLbits.SMT1CPW1           // bit 1, shadows bit in SMT1CPWLbits
#define CPW2                    SMT1CPWLbits.CPW2               // bit 2, shadows bit in SMT1CPWLbits
#define SMT1CPW2                SMT1CPWLbits.SMT1CPW2           // bit 2, shadows bit in SMT1CPWLbits
#define CPW3                    SMT1CPWLbits.CPW3               // bit 3, shadows bit in SMT1CPWLbits
#define SMT1CPW3                SMT1CPWLbits.SMT1CPW3           // bit 3, shadows bit in SMT1CPWLbits
#define CPW4                    SMT1CPWLbits.CPW4               // bit 4, shadows bit in SMT1CPWLbits
#define SMT1CPW4                SMT1CPWLbits.SMT1CPW4           // bit 4, shadows bit in SMT1CPWLbits
#define CPW5                    SMT1CPWLbits.CPW5               // bit 5, shadows bit in SMT1CPWLbits
#define SMT1CPW5                SMT1CPWLbits.SMT1CPW5           // bit 5, shadows bit in SMT1CPWLbits
#define CPW6                    SMT1CPWLbits.CPW6               // bit 6, shadows bit in SMT1CPWLbits
#define SMT1CPW6                SMT1CPWLbits.SMT1CPW6           // bit 6, shadows bit in SMT1CPWLbits
#define CPW7                    SMT1CPWLbits.CPW7               // bit 7, shadows bit in SMT1CPWLbits
#define SMT1CPW7                SMT1CPWLbits.SMT1CPW7           // bit 7, shadows bit in SMT1CPWLbits

#define CPW16                   SMT1CPWUbits.CPW16              // bit 0, shadows bit in SMT1CPWUbits
#define SMT1CPW16               SMT1CPWUbits.SMT1CPW16          // bit 0, shadows bit in SMT1CPWUbits
#define CPW17                   SMT1CPWUbits.CPW17              // bit 1, shadows bit in SMT1CPWUbits
#define SMT1CPW17               SMT1CPWUbits.SMT1CPW17          // bit 1, shadows bit in SMT1CPWUbits
#define CPW18                   SMT1CPWUbits.CPW18              // bit 2, shadows bit in SMT1CPWUbits
#define SMT1CPW18               SMT1CPWUbits.SMT1CPW18          // bit 2, shadows bit in SMT1CPWUbits
#define CPW19                   SMT1CPWUbits.CPW19              // bit 3, shadows bit in SMT1CPWUbits
#define SMT1CPW19               SMT1CPWUbits.SMT1CPW19          // bit 3, shadows bit in SMT1CPWUbits
#define CPW20                   SMT1CPWUbits.CPW20              // bit 4, shadows bit in SMT1CPWUbits
#define SMT1CPW20               SMT1CPWUbits.SMT1CPW20          // bit 4, shadows bit in SMT1CPWUbits
#define CPW21                   SMT1CPWUbits.CPW21              // bit 5, shadows bit in SMT1CPWUbits
#define SMT1CPW21               SMT1CPWUbits.SMT1CPW21          // bit 5, shadows bit in SMT1CPWUbits
#define CPW22                   SMT1CPWUbits.CPW22              // bit 6, shadows bit in SMT1CPWUbits
#define SMT1CPW22               SMT1CPWUbits.SMT1CPW22          // bit 6, shadows bit in SMT1CPWUbits
#define CPW23                   SMT1CPWUbits.CPW23              // bit 7, shadows bit in SMT1CPWUbits
#define SMT1CPW23               SMT1CPWUbits.SMT1CPW23          // bit 7, shadows bit in SMT1CPWUbits

#define SMT1PR8                 SMT1PRHbits.SMT1PR8             // bit 0
#define SMT1PR9                 SMT1PRHbits.SMT1PR9             // bit 1
#define SMT1PR10                SMT1PRHbits.SMT1PR10            // bit 2
#define SMT1PR11                SMT1PRHbits.SMT1PR11            // bit 3
#define SMT1PR12                SMT1PRHbits.SMT1PR12            // bit 4
#define SMT1PR13                SMT1PRHbits.SMT1PR13            // bit 5
#define SMT1PR14                SMT1PRHbits.SMT1PR14            // bit 6
#define SMT1PR15                SMT1PRHbits.SMT1PR15            // bit 7

#define SMT1PR0                 SMT1PRLbits.SMT1PR0             // bit 0
#define SMT1PR1                 SMT1PRLbits.SMT1PR1             // bit 1
#define SMT1PR2                 SMT1PRLbits.SMT1PR2             // bit 2
#define SMT1PR3                 SMT1PRLbits.SMT1PR3             // bit 3
#define SMT1PR4                 SMT1PRLbits.SMT1PR4             // bit 4
#define SMT1PR5                 SMT1PRLbits.SMT1PR5             // bit 5
#define SMT1PR6                 SMT1PRLbits.SMT1PR6             // bit 6
#define SMT1PR7                 SMT1PRLbits.SMT1PR7             // bit 7

#define SMT1PR16                SMT1PRUbits.SMT1PR16            // bit 0
#define SMT1PR17                SMT1PRUbits.SMT1PR17            // bit 1
#define SMT1PR18                SMT1PRUbits.SMT1PR18            // bit 2
#define SMT1PR19                SMT1PRUbits.SMT1PR19            // bit 3
#define SMT1PR20                SMT1PRUbits.SMT1PR20            // bit 4
#define SMT1PR21                SMT1PRUbits.SMT1PR21            // bit 5
#define SMT1PR22                SMT1PRUbits.SMT1PR22            // bit 6
#define SMT1PR23                SMT1PRUbits.SMT1PR23            // bit 7

#define SSEL0                   SMT1SIGbits.SSEL0               // bit 0, shadows bit in SMT1SIGbits
#define SMT1SSEL0               SMT1SIGbits.SMT1SSEL0           // bit 0, shadows bit in SMT1SIGbits
#define SSEL1                   SMT1SIGbits.SSEL1               // bit 1, shadows bit in SMT1SIGbits
#define SMT1SSEL1               SMT1SIGbits.SMT1SSEL1           // bit 1, shadows bit in SMT1SIGbits
#define SSEL2                   SMT1SIGbits.SSEL2               // bit 2, shadows bit in SMT1SIGbits
#define SMT1SSEL2               SMT1SIGbits.SMT1SSEL2           // bit 2, shadows bit in SMT1SIGbits
#define SSEL3                   SMT1SIGbits.SSEL3               // bit 3, shadows bit in SMT1SIGbits
#define SMT1SSEL3               SMT1SIGbits.SMT1SSEL3           // bit 3, shadows bit in SMT1SIGbits
#define SSEL4                   SMT1SIGbits.SSEL4               // bit 4, shadows bit in SMT1SIGbits
#define SMT1SSEL4               SMT1SIGbits.SMT1SSEL4           // bit 4, shadows bit in SMT1SIGbits

#define SMU1SIGPPS0             SMT1SIGPPSbits.SMU1SIGPPS0      // bit 0
#define SMU1SIGPPS1             SMT1SIGPPSbits.SMU1SIGPPS1      // bit 1
#define SMU1SIGPPS2             SMT1SIGPPSbits.SMU1SIGPPS2      // bit 2
#define SMU1SIGPPS3             SMT1SIGPPSbits.SMU1SIGPPS3      // bit 3
#define SMU1SIGPPS4             SMT1SIGPPSbits.SMU1SIGPPS4      // bit 4

#define AS                      SMT1STATbits.AS                 // bit 0, shadows bit in SMT1STATbits
#define SMT1AS                  SMT1STATbits.SMT1AS             // bit 0, shadows bit in SMT1STATbits
#define WS                      SMT1STATbits.WS                 // bit 1, shadows bit in SMT1STATbits
#define SMT1WS                  SMT1STATbits.SMT1WS             // bit 1, shadows bit in SMT1STATbits
#define TS                      SMT1STATbits.TS                 // bit 2, shadows bit in SMT1STATbits
#define SMT1TS                  SMT1STATbits.SMT1TS             // bit 2, shadows bit in SMT1STATbits
#define RST                     SMT1STATbits.RST                // bit 5, shadows bit in SMT1STATbits
#define SMT1RESET               SMT1STATbits.SMT1RESET          // bit 5, shadows bit in SMT1STATbits
#define CPWUP                   SMT1STATbits.CPWUP              // bit 6, shadows bit in SMT1STATbits
#define SMT1CPWUP               SMT1STATbits.SMT1CPWUP          // bit 6, shadows bit in SMT1STATbits
#define CPRUP                   SMT1STATbits.CPRUP              // bit 7, shadows bit in SMT1STATbits
#define SMT1CPRUP               SMT1STATbits.SMT1CPRUP          // bit 7, shadows bit in SMT1STATbits

#define SMT1TMR8                SMT1TMRHbits.SMT1TMR8           // bit 0
#define SMT1TMR9                SMT1TMRHbits.SMT1TMR9           // bit 1
#define SMT1TMR10               SMT1TMRHbits.SMT1TMR10          // bit 2
#define SMT1TMR11               SMT1TMRHbits.SMT1TMR11          // bit 3
#define SMT1TMR12               SMT1TMRHbits.SMT1TMR12          // bit 4
#define SMT1TMR13               SMT1TMRHbits.SMT1TMR13          // bit 5
#define SMT1TMR14               SMT1TMRHbits.SMT1TMR14          // bit 6
#define SMT1TMR15               SMT1TMRHbits.SMT1TMR15          // bit 7

#define SMT1TMR0                SMT1TMRLbits.SMT1TMR0           // bit 0
#define SMT1TMR1                SMT1TMRLbits.SMT1TMR1           // bit 1
#define SMT1TMR2                SMT1TMRLbits.SMT1TMR2           // bit 2
#define SMT1TMR3                SMT1TMRLbits.SMT1TMR3           // bit 3
#define SMT1TMR4                SMT1TMRLbits.SMT1TMR4           // bit 4
#define SMT1TMR5                SMT1TMRLbits.SMT1TMR5           // bit 5
#define SMT1TMR6                SMT1TMRLbits.SMT1TMR6           // bit 6
#define SMT1TMR7                SMT1TMRLbits.SMT1TMR7           // bit 7

#define SMT1TMR16               SMT1TMRUbits.SMT1TMR16          // bit 0
#define SMT1TMR17               SMT1TMRUbits.SMT1TMR17          // bit 1
#define SMT1TMR18               SMT1TMRUbits.SMT1TMR18          // bit 2
#define SMT1TMR19               SMT1TMRUbits.SMT1TMR19          // bit 3
#define SMT1TMR20               SMT1TMRUbits.SMT1TMR20          // bit 4
#define SMT1TMR21               SMT1TMRUbits.SMT1TMR21          // bit 5
#define SMT1TMR22               SMT1TMRUbits.SMT1TMR22          // bit 6
#define SMT1TMR23               SMT1TMRUbits.SMT1TMR23          // bit 7

#define WSEL0                   SMT1WINbits.WSEL0               // bit 0, shadows bit in SMT1WINbits
#define SMT1WSEL0               SMT1WINbits.SMT1WSEL0           // bit 0, shadows bit in SMT1WINbits
#define WSEL1                   SMT1WINbits.WSEL1               // bit 1, shadows bit in SMT1WINbits
#define SMT1WSEL1               SMT1WINbits.SMT1WSEL1           // bit 1, shadows bit in SMT1WINbits
#define WSEL2                   SMT1WINbits.WSEL2               // bit 2, shadows bit in SMT1WINbits
#define SMT1WSEL2               SMT1WINbits.SMT1WSEL2           // bit 2, shadows bit in SMT1WINbits
#define WSEL3                   SMT1WINbits.WSEL3               // bit 3, shadows bit in SMT1WINbits
#define SMT1WSEL3               SMT1WINbits.SMT1WSEL3           // bit 3, shadows bit in SMT1WINbits
#define WSEL4                   SMT1WINbits.WSEL4               // bit 4, shadows bit in SMT1WINbits
#define SMT1WSEL4               SMT1WINbits.SMT1WSEL4           // bit 4, shadows bit in SMT1WINbits

#define SMU1WINPPS0             SMT1WINPPSbits.SMU1WINPPS0      // bit 0
#define SMU1WINPPS1             SMT1WINPPSbits.SMU1WINPPS1      // bit 1
#define SMU1WINPPS2             SMT1WINPPSbits.SMU1WINPPS2      // bit 2
#define SMU1WINPPS3             SMT1WINPPSbits.SMU1WINPPS3      // bit 3
#define SMU1WINPPS4             SMT1WINPPSbits.SMU1WINPPS4      // bit 4

